[
    {
        "headline": "US urges citizens to leave Lebanon on 'any available ticket'",
        "location": "US urges citizens to leave Lebanon on 'any available ticket' - Lebanon"
    },
    {
        "headline": "Iran says Hamas leader killed from close range",
        "location": "Iran says Hamas leader killed from close range - Iran (also referenced later)"
    },
    {
        "headline": "Watch: Supercell tornado sweeps through El Toro in Spain",
        "location": "Watch: Supercell tornado sweeps through El Toro in Spain - Spain"
    },
    {
        "headline": "Beach attack in Somali capital kills dozens",
        "location": "Beach attack in Somali capital kills dozens - Somalia"
    },
    {
        "headline": "Trump and Harris at odds over presidential debate",
        "location": "Trump and Harris at odds over presidential debate - USA"
    },
    {
        "headline": "Iran says Hamas leader killed from close range",
        "location": "Iran says Hamas leader killed from close range - Iran (same as #2, different article)"
    },
    {
        "headline": "Venezuela opposition leader emerges despite arrest threat",
        "location": "Venezuela opposition leader emerges despite arrest threat - Venezuela"
    },
    {
        "headline": "Ukraine says it sank Russian submarine in Crimea",
        "location": "Ukraine says it sank Russian submarine in Crimea - Ukraine"
    },
    {
        "headline": "Watch: Supercell tornado sweeps through El Toro in Spain",
        "location": "Watch: Supercell tornado sweeps through El Toro in Spain - Spain (same as #3)"
    },
    {
        "headline": "Snoop Dogg: America's cheerleader at the Olympics",
        "location": "Snoop Dogg: America's cheerleader at the Olympics - USA"
    },
    {
        "headline": "Spies' children did not know they were Russian",
        "location": "Spies' children did not know they were Russian - Russia (also referenced later)"
    },
    {
        "headline": "'Still alive' - graduate Asmaa's texts to BBC from the ruins of Gaza",
        "location": "'Still alive' - graduate Asmaa's texts to BBC from the ruins of Gaza - Palestine/Gaza"
    },
    {
        "headline": "Dozens of children killed in Bangladesh protests - Unicef",
        "location": "Dozens of children killed in Bangladesh protests - Unicef - Bangladesh"
    },
    {
        "headline": "Plea deal with accused 9/11 plotters revoked",
        "location": "Plea deal with accused 9/11 plotters revoked - USA"
    },
    {
        "headline": "Watch/Listen",
        "location": "Watch/Listen (no country referenced)"
    },
    {
        "headline": "Watch: Supercell tornado sweeps through El Toro in Spain",
        "location": "Watch: Supercell tornado sweeps through El Toro in Spain - Spain (same as #3 and #9)"
    },
    {
        "headline": "From captivity to freedom - How prisoner swap unfolded",
        "location": "From captivity to freedom - How prisoner swap unfolded (refers to several countries, no specific one mentioned)"
    },
    {
        "headline": "Toddler rescued after falling down 10ft pipe",
        "location": "Toddler rescued after falling down 10ft pipe - No country referenced (presumably a generic article from a news organization)"
    },
    {
        "headline": "Russian prisoners arrive in Moscow following swap",
        "location": "Russian prisoners arrive in Moscow following swap - Russia"
    },
    {
        "headline": "Russian TV shows freed prisoners board plane after swap",
        "location": "Russian TV shows freed prisoners board plane after swap - Russia (same as #19)"
    },
    {
        "headline": "Features",
        "location": "Features (no country referenced)"
    },
    {
        "headline": "World's biggest iceberg spins in ocean trap",
        "location": "World's biggest iceberg spins in ocean trap - Antarctica/International waters"
    },
    {
        "headline": "Why Putin thinks he's the winner in prisoner swap",
        "location": "Why Putin thinks he's the winner in prisoner swap - Russia"
    },
    {
        "headline": "Kim Jong Un wants Trump back, elite defector tells BBC",
        "location": "Kim Jong Un wants Trump back, elite defector tells BBC - North Korea"
    },
    {
        "headline": "Beauty contest sparks row over who counts as South African",
        "location": "Beauty contest sparks row over who counts as South African - South Africa"
    },
    {
        "headline": "A bear mauled a Romanian teen to death. Will a cull solve the problem?",
        "location": "A bear mauled a Romanian teen to death. Will a cull solve the problem? - Romania"
    },
    {
        "headline": "Latest updates",
        "location": "Latest updates (no country referenced)"
    },
    {
        "headline": "He lost two homes to California fires in six years. Now what?",
        "location": "He lost two homes to California fires in six years. Now what? - USA (specifically California)"
    },
    {
        "headline": "US urges citizens to leave Lebanon on 'any available ticket'",
        "location": "US urges citizens to leave Lebanon on 'any available ticket' - Lebanon (same as #1, different article)"
    },
    {
        "headline": "Snoop Dogg: America's cheerleader at the Olympics",
        "location": "Snoop Dogg: America's cheerleader at the Olympics - USA"
    },
    {
        "headline": "Trump and Harris at odds over presidential debate",
        "location": "Trump and Harris at odds over presidential debate - USA"
    },
    {
        "headline": "Stephen Nedoroscik is America's pommel horse hero",
        "location": "Stephen Nedoroscik is America's pommel horse hero - USA"
    },
    {
        "headline": "Ukraine says it sank Russian submarine in Crimea",
        "location": "Ukraine says it sank Russian submarine in Crimea - Ukraine (same as #8, different article)"
    },
    {
        "headline": "Canada Covid protesters cleared of plotting to kill police",
        "location": "Canada Covid protesters cleared of plotting to kill police - Canada"
    },
    {
        "headline": "Spies' children did not know they were Russian",
        "location": "Spies' children did not know they were Russian - Russia (same as #11 and #43)"
    },
    {
        "headline": "Iran says Hamas leader killed from close range",
        "location": "Iran says Hamas leader killed from close range - Iran (same as #2 and #6)"
    },
    {
        "headline": "Follow BBC on:",
        "location": "Follow BBC on: (no country referenced, but likely an international news organization)"
    },
    {
        "headline": "Death of Hamas chief draws mixed reactions in war-battered Gaza",
        "location": "Death of Hamas chief draws mixed reactions in war-battered Gaza - Palestine/Gaza"
    },
    {
        "headline": "Iran gives first detailed statement on Hamas leader’s killing",
        "location": "Iran gives first detailed statement on Hamas leader’s killing - Iran (same as #36, different article)"
    },
    {
        "headline": "Taiwan is readying citizens for a Chinese invasion. It’s not going well.",
        "location": "Taiwan is readying citizens for a Chinese invasion. It’s not going well. - Taiwan"
    },
    {
        "headline": "They were in prison in the West. Now they’re celebrities in Russia.",
        "location": "They were in prison in the West. Now they’re celebrities in Russia - Russia"
    },
    {
        "headline": "How many hostages are still in Gaza since Hamas attack on Israel? What to know.",
        "location": "How many hostages are still in Gaza since Hamas attack on Israel? What to know. - Palestine/Gaza"
    },
    {
        "headline": "Left and right have denounced Venezuela’s Maduro. Not the authoritarians.",
        "location": "Left and right have denounced Venezuela’s Maduro. Not the authoritarians. - Venezuela (same as #7)"
    },
    {
        "headline": "Al Jazeera rejects Israeli allegation that slain journalist was Hamas fighter",
        "location": "Al Jazeera rejects Israeli allegation that slain journalist was Hamas fighter - Qatar/Israel/Palestine (complex article with multiple countries referenced)"
    },
    {
        "headline": "U.S. forces move toward Israel as Iran threatens to attack",
        "location": "U.S. forces move toward Israel as Iran threatens to attack - USA/Iran"
    },
    {
        "headline": "After assassinations, Israel braces for retaliation, wider conflict",
        "location": "After assassinations, Israel braces for retaliation, wider conflict - Israel"
    },
    {
        "headline": "Homeland Security Dept. pauses Biden parole program for four countries",
        "location": "Homeland Security Dept. pauses Biden parole program for four countries - USA (likely references other international agreements or partnerships with the US)"
    },
    {
        "headline": "Children returned to Russia had no idea parents were spies, Kremlin says",
        "location": "Children returned to Russia had no idea parents were spies, Kremlin says - Russia"
    },
    {
        "headline": "Russian opposition figure Ilya Yashin says he demanded not to be freed",
        "location": "Russian opposition figure Ilya Yashin says he demanded not to be freed - Russia"
    },
    {
        "headline": "Ukraine watches warily as prisoner swap shows Moscow and West can negotiate",
        "location": "Ukraine watches warily as prisoner swap shows Moscow and West can negotiate - Ukraine (same as #8)"
    },
    {
        "headline": "Kremlin hails return of spies but says swap won’t end fight over Ukraine",
        "location": "Kremlin hails return of spies but says swap won’t end fight over Ukraine - Russia (same as #49, different article)"
    },
    {
        "headline": "‘I love my black job’: Simone Biles joins those throwing shade at Trump",
        "location": "‘I love my black job’: Simone Biles joins those throwing shade at Trump - USA"
    },
    {
        "headline": "3 Americans freed in major prisoner swap with Russia are welcomed home",
        "location": "Location not found"
    },
    {
        "headline": "For Parisians, Olympic summer brings frustrations but also joy",
        "location": "Location not found"
    },
    {
        "headline": "As Hamas leader is buried in Qatar, Biden says killing didn’t help cease-fire talks",
        "location": "Location not found"
    },
    {
        "headline": "American teacher detained in Russia ‘left behind again’ in prisoner swap",
        "location": "Location not found"
    },
    {
        "headline": "Evan Gershkovich, others arrive in U.S. after landmark prisoner swap",
        "location": "Location not found"
    }
]