[
    {
        "headline": "Children dead in attack on football pitch in Israeli-occupied Golan",
        "location": "Children dead in attack on football pitch in Israeli-occupied Golan - Israel/Palestine (note: specific territory, not country)"
    },
    {
        "headline": "Israeli strike on Gaza school killed 30 - health ministry",
        "location": "Israeli strike on Gaza school killed 30 - health ministry - Israel/Palestine"
    },
    {
        "headline": "Top five stories from day one of Paris Olympics 2024",
        "location": "Top five stories from day one of Paris Olympics 2024 - France"
    },
    {
        "headline": "Olympian sorry to wife for losing wedding ring in Seine",
        "location": "Olympian sorry to wife for losing wedding ring in Seine - France"
    },
    {
        "headline": "Haunting portrait of young storm victim wins photo award",
        "location": "Haunting portrait of young storm victim wins photo award (no country mentioned, likely USA)"
    },
    {
        "headline": "Israeli strike on Gaza school killed 30 - health ministry",
        "location": "Israeli strike on Gaza school killed 30 - health ministry - Israel/Palestine"
    },
    {
        "headline": "Hunt for France rail vandals continues as more trains cancelled",
        "location": "Hunt for France rail vandals continues as more trains cancelled - France"
    },
    {
        "headline": "Huge California wildfire tears through 5,000 acres every hour",
        "location": "Huge California wildfire tears through 5,000 acres every hour - USA (specific state, not country)"
    },
    {
        "headline": "Top five stories from day one of Paris Olympics 2024",
        "location": "Top five stories from day one of Paris Olympics 2024 - France"
    },
    {
        "headline": "Tricked into conversion therapy in Russia for being trans",
        "location": "Tricked into conversion therapy in Russia for being trans - Russia"
    },
    {
        "headline": "First images of Jasper after 100m high wildfire hit",
        "location": "First images of Jasper after 100m high wildfire hit - Canada (specific province, not country)"
    },
    {
        "headline": "Trump courts crypto industry votes and campaign donations",
        "location": "Trump courts crypto industry votes and campaign donations - USA"
    },
    {
        "headline": "Canada deducted points and coach banned over drone",
        "location": "Canada deducted points and coach banned over drone - Canada"
    },
    {
        "headline": "Venezuela holds elections on Sunday. Could real change be coming?",
        "location": "Venezuela holds elections on Sunday. Could real change be coming? - Venezuela"
    },
    {
        "headline": "Watch/Listen",
        "location": "Watch/Listen (no specific news, so no country associated)"
    },
    {
        "headline": "Watch: Astronauts enjoy zero-gravity Olympics",
        "location": "Watch: Astronauts enjoy zero-gravity Olympics (likely France)"
    },
    {
        "headline": "Relive a wild month in US politics in about two minutes",
        "location": "Relive a wild month in US politics in about two minutes - USA"
    },
    {
        "headline": "How drones and the battle for Ukraine are changing the future of warfare",
        "location": "How drones and the battle for Ukraine are changing the future of warfare - Ukraine/Russia"
    },
    {
        "headline": "Vehicle drives through intense wildfire in California",
        "location": "Vehicle drives through intense wildfire in California - USA"
    },
    {
        "headline": "Watch: People rescued as Typhoon floods shops and streets",
        "location": "Watch: People rescued as Typhoon floods shops and streets (likely Philippines, but no specific country mentioned)"
    },
    {
        "headline": "Features",
        "location": "Features (no specific news, so no country associated)"
    },
    {
        "headline": "Why chaotic antiheroes like Deadpool are winning over superhero fans",
        "location": "Why chaotic antiheroes like Deadpool are winning over superhero fans (USA or UK, likely the latter, as it's a popular comic book character)"
    },
    {
        "headline": "Why we might never know the truth about ultra-processed foods",
        "location": "Why we might never know the truth about ultra-processed foods - USA"
    },
    {
        "headline": "The Palestinians heading to Paris to represent their people",
        "location": "The Palestinians heading to Paris to represent their people - France/Palestine (note: specific territory, not country)"
    },
    {
        "headline": "Kit Harrington defends play's 'black out' nights",
        "location": "Kit Harrington defends play's 'black out' nights (likely UK or Ireland)"
    },
    {
        "headline": "The Kenyan enthralled by the healing power of plants",
        "location": "The Kenyan enthralled by the healing power of plants - Kenya"
    },
    {
        "headline": "Latest updates",
        "location": "Latest updates (no specific news, so no country associated)"
    },
    {
        "headline": "The Kenyan enthralled by the healing power of plants",
        "location": "The Kenyan enthralled by the healing power of plants - Kenya"
    },
    {
        "headline": "The Palestinians heading to Paris to represent their people",
        "location": "The Palestinians heading to Paris to represent their people - France/Palestine"
    },
    {
        "headline": "Tricked into conversion therapy in Russia for being trans",
        "location": "Tricked into conversion therapy in Russia for being trans - Russia"
    },
    {
        "headline": "Haunting portrait of young storm victim wins photo award",
        "location": "Haunting portrait of young storm victim wins photo award (USA or UK, likely the former)"
    },
    {
        "headline": "Huge California wildfire tears through 5,000 acres every hour",
        "location": "Huge California wildfire tears through 5,000 acres every hour - USA"
    },
    {
        "headline": "Children dead in attack on football pitch in Israeli-occupied Golan",
        "location": "Children dead in attack on football pitch in Israeli-occupied Golan - Israel/Palestine"
    },
    {
        "headline": "Trump courts crypto industry votes and campaign donations",
        "location": "Trump courts crypto industry votes and campaign donations - USA"
    },
    {
        "headline": "Israeli strike on Gaza school killed 30 - health ministry",
        "location": "Israeli strike on Gaza school killed 30 - health ministry - Israel/Palestine"
    },
    {
        "headline": "Olympian sorry to wife for losing wedding ring in Seine",
        "location": "Olympian sorry to wife for losing wedding ring in Seine - France"
    },
    {
        "headline": "Follow BBC on:",
        "location": "Follow BBC on: (BBC is a UK-based media outlet)"
    },
    {
        "headline": "Attacks in Gaza and Golan Heights kill more than 40, many of them children",
        "location": "Attacks in Gaza and Golan Heights kill more than 40, many of them children - Israel/Palestine"
    },
    {
        "headline": "After ‘big show’ in U.S., Netanyahu returns to turmoil at home",
        "location": "After ‘big show’ in U.S., Netanyahu returns to turmoil at home - Israel"
    },
    {
        "headline": "How many athletes are in the Paris Olympics, and other key numbers",
        "location": "How many athletes are in the Paris Olympics, and other key numbers - France"
    },
    {
        "headline": "In Miami, Venezuelan diaspora anxiously watches a vote it can’t participate in",
        "location": "In Miami, Venezuelan diaspora anxiously watches a vote it can’t participate in - USA/Venezuela"
    },
    {
        "headline": "Netanyahu’s U.S. visit revealed ‘no workable plan’ for peace, critics say",
        "location": "Netanyahu’s U.S. visit revealed ‘no workable plan’ for peace, critics say - Israel/USA"
    },
    {
        "headline": "U.S., Japan to unveil first steps towards enhanced military alliance",
        "location": "U.S., Japan to unveil first steps towards enhanced military alliance - USA/Japan"
    },
    {
        "headline": "If Maduro loses, will he cede power? Venezuela’s election, explained.",
        "location": "If Maduro loses, will he cede power? Venezuela’s election, explained. - Venezuela"
    },
    {
        "headline": "Russia, adapting tactics, advances in Donetsk and takes more Ukrainian land",
        "location": "Russia, adapting tactics, advances in Donetsk and takes more Ukrainian land - Ukraine/Russia"
    },
    {
        "headline": "The Paris Olympics, in comics",
        "location": "The Paris Olympics, in comics (likely France)"
    },
    {
        "headline": "Olympic Ceremonies on the Seine were a daring feat. Paris stuck the landing.",
        "location": "Olympic Ceremonies on the Seine were a daring feat. Paris stuck the landing. - France"
    },
    {
        "headline": "Mexico wasn’t told of cartel arrests until kingpins were in U.S. custody",
        "location": "Mexico wasn’t told of cartel arrests until kingpins were in U.S. custody - USA/Mexico"
    },
    {
        "headline": "Arson attacks target France’s high speed trains hours before Olympics",
        "location": "Arson attacks target France’s high speed trains hours before Olympics - France"
    },
    {
        "headline": "U.K. ending challenge to ICC arrest warrants for Israeli leaders",
        "location": "U.K. ending challenge to ICC arrest warrants for Israeli leaders - UK/Israel"
    },
    {
        "headline": "What to know about the Sinaloa cartel after the arrest of ‘El Mayo’",
        "location": "What to know about the Sinaloa cartel after the arrest of ‘El Mayo’ - Mexico (specific cartel, but no country mentioned)"
    },
    {
        "headline": "From ‘sunny ways’ to cloudy days: Canadians have tired of Justin Trudeau",
        "location": "From ‘sunny ways’ to cloudy days: Canadians have tired of"
    },
    {
        "headline": "Video of police kicking man on ground at U.K. airport sparks protests",
        "location": "Location not found"
    },
    {
        "headline": "Russia wary of U.S. and France election surprises, especially Kamala Harris",
        "location": "Location not found"
    },
    {
        "headline": "Olympics quiz: Pick the right anthems, flags and avoid a diplomatic incident",
        "location": "Location not found"
    },
    {
        "headline": "How one Chinese machine tool maker is helping Russia’s war against Ukraine",
        "location": "Location not found"
    },
    {
        "headline": "Top Sinaloa cartel leader taken into U.S. custody alongside son of  ‘El Chapo’",
        "location": "Location not found"
    }
]