[
    {
        "location": "Australia",
        "summary": "• The graduation ceremony takes place after a 50-year delay.\n• A milestone event occurs 50 years late to its original schedule.\n• Historic moment marks a significant occasion in Australian history.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Canada",
        "summary": "• British Columbia has become the first Canadian province to decriminalize hard drugs in 2017\n• However, the government is now considering reversing this decision\n• The reversal comes after concerns were raised about the impact on public health and safety",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• The cartoon cat is a popular character in China.\n• It has been criticized by Chinese authorities due to its humor.\n• As a result, the cartoonist is being targeted by censors.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Denmark",
        "summary": "• Police rule out political motive behind attack on Danish PM.\n• Authorities investigate incident to ensure safety and security.\n• Prime Minister's office confirms no political motivations were found.",
        "coordinates": [
            55.670249,
            10.3333283
        ]
    },
    {
        "location": "France",
        "summary": "• French President Emmanuel Macron is considering calling a snap election after suffering defeats in recent European polls.\n• Macron views snap elections as an \"act of trust\" to regain public confidence.\n• The European Parliament has shifted towards the right wing, leading to Macron's consideration of early elections.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Iceland",
        "summary": "• A massive lava flow has engulfed a road in Iceland.\n• The volcanic eruption caused widespread destruction along the affected area.\n• Emergency services were deployed to rescue stranded motorists and aid those impacted by the disaster.",
        "coordinates": [
            64.9841821,
            -18.1059013
        ]
    },
    {
        "location": "India",
        "summary": "• Narendra Modi sworn in for third term at grand ceremony in Delhi \n• Coalition to make Prime Minister Modi humble\n• Sworn in as PM for third term with familiar allies",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Ireland",
        "summary": "• The Irish government is fighting for dominance in local elections.\n• Parties are competing to take the lead in these elections.\n• The outcome will determine who controls the country's government.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• A father of an Israeli hostage was tragically killed the day before his son was rescued.\n• Benny Gantz has quit the Israeli war cabinet due to disagreements with Prime Minister Benjamin Netanyahu.\n• Four Israeli hostages were successfully rescued after being held captive in Gaza.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• The tragic death of a popular Nigerian actor has raised concerns about safety protocols in the entertainment industry.\n• A Nigerian teenager was allegedly abducted by sextortion scammers who demanded a ransom from his family within six hours before he was found dead.\n• As a result, the film industry is now reviewing its safety measures to prevent similar incidents in the future.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• The centre-right party is set to increase its majority in the European Union election.\n• Far-right parties have made significant gains in the election.\n• Michael Mosley's wife has paid tribute to her late husband, describing him as kind.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Former President Trump will appear for a probation interview on Monday.\n• A 100-year-old World War II veteran married his 96-year-old bride near the beaches where he fought during the war.\n• The US has started sending aid back to Gaza again after fixing its damaged military pier.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]