[
    {
        "location": "Australia",
        "summary": "• A breaching whale capsized a boat in Australia, sending two people overboard.\n• Retired Australian footballer returns to Olympics after a long break.\n• Two men were rescued from the ocean after their boat was flipped by a whale's breach.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Brazil",
        "summary": "• Carbon trading allows companies to profit from the preservation of the Amazon rainforest.\n• The industry is often criticized for its potential to contribute to deforestation and environmental degradation.\n• Some experts argue that carbon credits can be an effective tool for incentivizing sustainable land use practices.",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "Ethiopia",
        "summary": "• Rescuers dig through rubble after deadly landslides hit Ethiopia\n• Heavy rainfall triggers devastating floods in Ethiopia's Amhara region\n• Death toll rises to over 150 as rescue efforts continue in Ethiopia",
        "coordinates": [
            10.2116702,
            38.6521203
        ]
    },
    {
        "location": "France",
        "summary": "• The 1972 Munich Olympics were marred by the killing of Israeli athletes.\n• This event still casts a shadow over the upcoming Paris Games.\n• The tragedy highlights the ongoing struggle to ensure athlete safety in international competitions.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• Europeans experience thrilling swings in Berlin.\n• The high-flying sensation offers breathtaking views.\n• Thrill-seekers flock to the unique attraction.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Israel",
        "summary": "• Netanyahu defends Gaza war amid protests outside US Congress.\n• Thousands gather to protest during his Congressional address.\n• Netanyahu has a long history of clashes with US Presidents.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Mauritania",
        "summary": "• At least twenty-five people died in a shipwreck off the coast of Mauritania.\n• The incident occurred on or after January 1st, 2022, but exact date is unknown due to limited reporting.\n• Authorities are investigating the cause of the wreck and searching for survivors.",
        "coordinates": [
            20.2540382,
            -9.2399263
        ]
    },
    {
        "location": "Morocco",
        "summary": "• Morocco defeats Argentina\n• Crowd trouble disrupts the match\n• Morocco wins despite chaos",
        "coordinates": [
            28.3347722,
            -10.371337908392647
        ]
    },
    {
        "location": "Namibia",
        "summary": "• Namibia has started to issue visas to citizens from Western countries.\n• The move is seen as a response to the restrictive policies imposed by Western countries on African immigrants.\n• This decision aims to promote greater understanding and cooperation between Namibia and its international partners.",
        "coordinates": [
            -23.2335499,
            17.3231107
        ]
    },
    {
        "location": "Nepal",
        "summary": "• The pilot survives the Nepal crash when the cockpit splits from the plane.\n• A Nepal plane crashed at Kathmandu airport, killing 18 people.",
        "coordinates": [
            28.3780464,
            83.9999901
        ]
    },
    {
        "location": "New Zealand",
        "summary": "• An American reality show contestant kills and consumes a protected bird species in New Zealand.\n• The action is considered illegal under New Zealand's wildlife protection laws.\n• This incident sparks concern among environmentalists and wildlife enthusiasts about the impact on local ecosystems.",
        "coordinates": [
            -41.5000831,
            172.8344077
        ]
    },
    {
        "location": "South Korea",
        "summary": "• North Korea dropped balloons carrying trash onto the grounds of South Korea's presidential office.\n• The incident occurred near the Blue House, which is the official residence of the South Korean president.\n• This act of aggression has sparked tensions between the two nations.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Taiwan",
        "summary": "• Typhoon Gaemi makes landfall in Taiwan.\n• The typhoon has caused widespread damage to buildings, infrastructure, and transportation systems.\n• Emergency services are working to evacuate people from affected areas and provide assistance.",
        "coordinates": [
            23.5983227,
            120.83537694479215
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Drones have opened a new front in the war, threatening to escalate violence.\n• The increased use of drones has added complexity to the conflict, making it harder to predict outcomes.\n• This development highlights the ongoing brutal nature of the war and its devastating impact on civilians.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• The man who attacked author Salman Rushdie has been charged with supporting the militant group Hezbollah.\n• UK royal family members will receive a significant salary increase due to the Crown Estate's record-breaking £1.04 billion profits.\n• Author Salman Rushdie was attacked by an assailant; the attacker is now facing charges related to his alleged support of the militant group Hezbollah.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Joe Biden dropped out of the presidential race to unite his party and the nation.\n• A graphic video revealed that U.S. police were positioned near the body of an assassin who targeted Donald Trump at one of his rallies.\n• The assassin researched information about John F. Kennedy’s assassination before carrying out his own attack.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Venezuela",
        "summary": "• Edmundo González is running against Nicolás Maduro in Venezuela's presidential election\n• He is a former opposition leader who has criticized Maduro's government\n• González hopes to bring change to the country through his campaign",
        "coordinates": [
            8.0018709,
            -66.1109318
        ]
    }
]