[
    {
        "location": "Denmark",
        "summary": "• The Danish Prime Minister was attacked by a man in Copenhagen.\n• A suspect has been arrested in connection with the incident.\n• The attack occurred on the street in Copenhagen.",
        "coordinates": [
            55.670249,
            10.3333283
        ]
    },
    {
        "location": "France",
        "summary": "• France and its allies will finalize a plan to deploy military trainers to Ukraine.\n• US President Joe Biden, other global leaders, and war veterans gather in France to commemorate the 80th anniversary of D-Day.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Ireland",
        "summary": "• The Irish polls have closed for both local and European Union elections.\n• This marks the end of voting for these crucial elections.\n• Results will be announced soon, determining the outcome of the contests.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• The United Nations has added Israel to its list of militaries committing violations against children.\n• An Israeli official is poised to resign due to a failed post-war plan.\n• Israel may launch an attack on Lebanon amid growing tensions with Hezbollah.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• Giorgia Meloni has taken a personal approach to campaigning for the European Parliament elections in Italy.\n• The election will decide which party will hold the presidency of the European Commission, with significant implications for Italy's role in the EU.\n• Meloni is emphasizing her leadership experience and commitment to promoting Italian interests within the EU.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Kenyan President Uhuru Kenyatta has urged citizens to pay their taxes promptly and honestly.\n• The government aims to use tax revenue to fund essential public services such as healthcare, education, and infrastructure development.\n• By paying taxes, individuals contribute to the country's growth and prosperity.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Netherlands",
        "summary": "• The European Union's election campaign has begun in the Netherlands, with an exit poll indicating a close race.\n• A recent survey suggests that the outcome is too close to call at this stage.\n• The result will have significant implications for the country's direction and policies moving forward.",
        "coordinates": [
            52.2434979,
            5.6343227
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• A couple got married in a Ukrainian bunker but the groom died two days later.\n• Russia's attacks have caused widespread blackouts in Ukraine due to damage to power plants.\n• The Gaza aid pier has been severely damaged by Russian airstrikes, resulting in estimated losses of at least $22 million.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• UK Prime Minister Rishi Sunak has apologized for leaving the D-Day commemorations early.\n• Refugees on a remote UK island have spoken to the BBC about their experiences.\n• Two British judges have left the Hong Kong court system due to political reasons.\n• Former UK Prime Minister David Cameron fell victim to a prank phone call.\n• TV personality Michael Mosley is currently missing while vacationing in Greece.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Fatal black bear attack a first in California history\n• Biden apologizes for delay in Ukraine military aid\n• US jobs surge casts doubt over interest rate cuts",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Yemen",
        "summary": "• The United Nations has confirmed that 11 of its personnel were detained by Houthi rebels in Yemen.\n• The individuals involved work for the United Nations Assistance Mission to Yemen (UNHRC).\n• The organization is working to secure their release and ensure their safety.",
        "coordinates": [
            16.3471243,
            47.8915271
        ]
    }
]