[
    {
        "location": "Bolivia",
        "summary": "• A failed coup attempt occurred in Bolivia.\n• The event lasted approximately 75 seconds.\n• Details surrounding the incident remain unclear.",
        "coordinates": [
            -17.0568696,
            -64.9912286
        ]
    },
    {
        "location": "China",
        "summary": "• Two former Chinese defense ministers were expelled from the Communist Party due to corruption and abuse of power.\n• The expulsion is seen as a significant move by the party against high-ranking officials accused of wrongdoing.\n• The decision highlights the ongoing efforts to root out corruption within the government and military ranks in China.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Egypt",
        "summary": "• Gaza evacuees in Egypt live in difficult conditions\n• They face uncertainty about their future and lack support from authorities\n• Their living situation is precarious and uncertain",
        "coordinates": [
            26.2540493,
            29.2675469
        ]
    },
    {
        "location": "France",
        "summary": "• The far-right party is leading in the elections and aiming for a majority\n• Armed men stormed a wedding killing one person\n• Voters punished Macron's centrists and boosted the far-right party in polls",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Haiti",
        "summary": "• The US Department of Homeland Security has extended Temporary Protected Status (TPS) for Haitian nationals in the United States.\n• This decision aims to ensure that Haitians can continue living safely in the US without fear of deportation during ongoing political instability at home.\n• TPS allows Haitian citizens who were already residing in the US when it was granted to remain legally until conditions improve in their homeland.",
        "coordinates": [
            19.1399952,
            -72.3570972
        ]
    },
    {
        "location": "India",
        "summary": "• Heavy monsoon rains cause severe damage to New Delhi's airport.\n• The airport's roof collapses due to excessive rainfall, resulting in structural failure.\n• At least one person is killed as vehicles beneath the collapsed roof are crushed.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• Iran's presidential election proceeds with a runoff due to low voter turnout.\n• The runoff pits a reformist candidate against a conservative one.\n• Voting hours have been extended for the snap election due to low participation.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Tensions escalate between Israel and Lebanon\n• US pushes for a deal to avoid conflict\n• Potential for war looms if agreement cannot be reached",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• At least 18 people were killed by suspected female suicide bombers in Nigeria.\n• The bombings occurred in an unspecified location within the country.\n• No further details on casualties or injuries have been reported.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "North Korea",
        "summary": "• A family escapes North Korea by crossing the open sea in a rickety boat.\n• The family faces numerous challenges during their perilous journey.\n• They finally reach safety after overcoming incredible obstacles.",
        "coordinates": [
            40.3736611,
            127.0870417
        ]
    },
    {
        "location": "South Korea",
        "summary": "• Parents lock themselves in cells to help their children overcome anxiety or depression.\n• This \"happiness factory\" is designed to provide emotional support to young people struggling with mental health issues.\n• By staying with their children, parents hope to foster a sense of security and comfort during difficult times.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Spain",
        "summary": "• Williams scores stunning goal\n• Spain defeats Georgia in match\n• Sets up quarter-final against Germany",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Sudan",
        "summary": "• A woman has identified her sister as one of the refugees captured in a video from Sudan.\n• The identification was made through a video of refugees caught up in Sudan's conflict.\n• The reunion brings hope to both women after being separated during the conflict.",
        "coordinates": [
            10.9,
            6.5
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• President Zelensky has called for increased supplies of long-range weapons.\n• A weekend was held in Kharkiv with activities including beach, table tennis, and poetry jams despite ongoing bombing by Russia.\n• The city is still under attack from Russia.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United States",
        "summary": "• Allies defend Biden against age concerns due to poll results.\n• The first presidential debate between Biden and Trump has taken place, with various reactions and analysis emerging.\n• Airlines have apologized for leaving passengers in wheelchairs on the tarmac at an airport terminal.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]