[
    {
        "location": "Australia",
        "summary": "• The Currumbin Wildlife Sanctuary in Queensland has stopped allowing visitors to cuddle with koalas due to concerns about animal welfare.\n• This move may spark controversy over whether other zoos and wildlife parks should also limit human interaction with animals.\n• By taking this step, the sanctuary aims to prioritize the health and well-being of its native species.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "China",
        "summary": "• The European Union has imposed new tariffs on Chinese electric cars.\n• This move is likely to increase prices for Chinese car manufacturers.\n• The tariffs may also affect trade relations between the two regions.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Ecuador",
        "summary": "• Police in Ecuador have freed 49 people from captivity after a gang had taken them.\n• The hostages were rescued during a raid on the gang's hideout.\n• Authorities say they will continue to work to dismantle the criminal organization responsible for the kidnapping.",
        "coordinates": [
            -1.3397668,
            -79.3666965
        ]
    },
    {
        "location": "France",
        "summary": "• Violent attacks in France before a crucial election.\n• Attacks have left many people injured or scared.\n• People fear violence may continue despite efforts to stop it.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Ghana",
        "summary": "• Ghanaian chef accused of faking Guinness World Records award.\n• Chef allegedly falsified records to gain recognition.\n• Investigation underway to uncover truth behind accusations.",
        "coordinates": [
            8.0300284,
            -1.0800271
        ]
    },
    {
        "location": "Iran",
        "summary": "• A hardliner and a reformist are competing in Iran's presidential runoff election.\n• The outcome will determine who becomes Iran's next president.\n• Iranians choose between these two candidates on election day.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel instructs Gaza ceasefire negotiators to restart their talks.\n• The resumption of negotiations aims to reach a lasting peace agreement.\n• Israeli authorities hope that renewed dialogue will lead to a stable resolution.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• Mount Etna erupts with lava at night.\n• Vandal cuts off Virgin's head from a sculpture.\n• Both events occur in Italy.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Jamaica",
        "summary": "• Hurricane Beryl has left many Jamaican homes without power.\n• The hurricane caused widespread damage to Jamaica's infrastructure.\n• After passing through Jamaica, the storm is now heading towards the Cayman Islands.",
        "coordinates": [
            18.1850507,
            -77.3947693
        ]
    },
    {
        "location": "Japan",
        "summary": "• Cup Noodles introduces new smores-flavored ramen.\n• This is an unexpected addition to their product line.\n• It was not requested by customers.",
        "coordinates": [
            36.5748441,
            139.2394179
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Hezbollah launched 200 rockets and drones towards Israel.\n• The attacks caused damage in some areas.\n• Israel responded with airstrikes on Hezbollah positions.",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Spain",
        "summary": "• A 51,000-year-old cave painting has been discovered in Spain.\n• The painting is believed to be one of the oldest scenes depicted through art.\n• It dates back an astonishing 51,000 years ago.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Ukraine accuses Russia of \"meat assaults\" in its attempts to gain territory.\n• The city of Kyiv has many statues that represent the impact of war on its residents.\n• The statues serve as symbols of Ukrainian resistance against the ongoing conflict with Russia.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• U.K. election exit polls predict a significant Labour victory, ending 14 years of Conservative rule.\n• Keir Starmer is poised to become the new Prime Minister.\n• Jewish voters who previously left the Labour party due to anti-Semitism concerns are rejoining.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Nearly 30,000 people have been evacuated due to California wildfires.\n• Former Vice President Joe Biden has admitted to \"screwing up\" during a recent debate, but vows to continue participating in the election.\n• An American citizen was imprisoned in Russia for 12 years after being convicted of drug charges.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]