[
    {
        "location": "Afghanistan",
        "summary": "• Taliban seeks to reconcile science and religion on climate change.\n• This move aims to address environmental challenges.\n• Climate change poses significant threats to Afghan communities.",
        "coordinates": [
            33.7680065,
            66.2385139
        ]
    },
    {
        "location": "Australia",
        "summary": "• The British monarch will pay an official state visit to Australia.\n• The royal couple will spend several days in the country from October onwards.\n• During their trip, they will engage in various activities, including cultural events and diplomatic meetings with local leaders.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Ecuador",
        "summary": "• \n• \n•",
        "coordinates": [
            -1.3397668,
            -79.3666965
        ]
    },
    {
        "location": "France",
        "summary": "• Princess Catherine makes public appearance after cancer diagnosis.\n• Olympic torch arrives in Paris for Bastille Day parade.\n• Princess Catherine and Olympic torch appear together on Bastille Day.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Gambia",
        "summary": "• A girl in Gambia was secretly circumcised despite her family's opposition.\n• The country is considering lifting its ban on female circumcision.\n• Female circumcision remains a contentious issue globally due to its cultural significance and human rights implications.",
        "coordinates": [
            13.470062,
            -15.4900464
        ]
    },
    {
        "location": "Germany",
        "summary": "• Germany is implementing a policy that forces certain asylum seekers to take on labor-intensive tasks.\n• Asylum seekers in Germany are being compelled to work under duress rather than pursuing employment opportunities of their choice.\n• This approach has sparked controversy among human rights advocates who argue it undermines the dignity of refugees seeking refuge in Germany.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "India",
        "summary": "• Star-studded Ambani wedding continues with celebrations.\n• Asia's richest man hosts lavish, spectacular wedding.\n• Event sparks controversy over its opulence and extravagance.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Israel",
        "summary": "• Senior Hamas commander killed in Israeli airstrike.\n• 90 killed in Israeli airstrikes on Gaza targeting Hamas military leader.\n• Gaps remain as Israel and Hamas negotiate ceasefire deal.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Kenya's police under investigation after human remains discovered\n• Professors struggle to address abuse allegations in their teaching methods\n• Kenyan President replaces controversial cabinet members amidst ongoing protests",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• At least 13 children died when a building housing a primary school collapsed in Lagos, Nigeria.\n• The incident occurred during lunchtime on a Friday afternoon at the three-story structure built over 50 years ago with multiple extensions.\n• Survivors were taken to nearby hospitals for treatment after emergency responders arrived quickly on the scene.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "Rwanda",
        "summary": "• An individual named Thomas Matthew Crooks is identified in connection with an attempted attack on US President Donald Trump.\n• Conspiracy theories and hate speech have spread on social media platforms following the incident.\n• Rwandan President Paul Kagame has announced his intention to seek a fourth presidential term.",
        "coordinates": [
            -1.9646631,
            30.0644358
        ]
    },
    {
        "location": "South Korea",
        "summary": "• Trader Joe's seasoning banned in South Korea due to its popularity\n• The seasoning gained widespread use despite being prohibited by law\n• Authorities have taken steps to enforce the ban and promote compliance with regulations",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Princess Kate will present the trophy to the men's Wimbledon winner.\n• The presentation is confirmed by the palace.\n• This highlights her role in supporting British sports achievements.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "•\tTrump shooter on the roof fires at Trump who is ducked by security\n•\tDemocrats stick with Joe Biden due to his policy stance\n•\tGunman kills man who jumps in front of him to protect family",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Zambia",
        "summary": "• Education in Zambia was made free by the government.\n• As a result, classrooms became overcrowded due to increased demand.\n• This has led to challenges in providing quality education amidst the high number of students.",
        "coordinates": [
            -14.5189121,
            27.5589884
        ]
    }
]