[
    {
        "location": "Argentina",
        "summary": "• The IMF predicts that Argentina's economy will grow by 4% in 2021 due to improved policies.\n• The peso has appreciated against the US dollar since October 2019.\n• Inflation remains high at around 45%.",
        "coordinates": [
            -34.9964963,
            -64.9672817
        ]
    },
    {
        "location": "Cyprus",
        "summary": "• A YouTuber who gained fame through his prank videos has been elected as a Member of European Parliament (MEP) from Cyprus.\n• This unexpected election win highlights the power of social media influence on politics.\n• As an MEP, he will represent the people of Cyprus in the European Parliament.",
        "coordinates": [
            34.9174159,
            32.889902651331866
        ]
    },
    {
        "location": "France",
        "summary": "• French President Emmanuel Macron calls a snap election after the EU vote.\n• A French police officer is detained over the alleged murder of a 19-year-old woman.\n• The far-right party has made significant gains in the European Parliament elections.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Iceland",
        "summary": "• A massive lava flow has engulfed a major road in Iceland\n• The eruption occurred at the Fagradalsfjall volcano near Krysuvik, a popular tourist destination\n• Emergency responders and scientists have been deployed to monitor the situation and ensure public safety",
        "coordinates": [
            64.9841821,
            -18.1059013
        ]
    },
    {
        "location": "India",
        "summary": "• Benny Gantz, former Israeli Defense Minister, has resigned from his position in the war cabinet.\n• His resignation comes amid controversies surrounding Israel's handling of COVID-19 pandemic and national security issues.\n• The move may impact Israel's military strategy and regional alliances, potentially leading to changes in government policies.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Ireland",
        "summary": "• The European Parliament is shifting towards the right.\n• Fine Gael and Fianna Fáil are leading in the Irish elections.\n• These developments occurred on a dramatic night in Europe.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• Four Israeli hostages were rescued alive.\n• The death toll in the conflict has risen to over 200.\n• Gantz is leaving the emergency government in response to Netanyahu's leadership.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Malawi",
        "summary": "• An aircraft carrying Malawi's Vice President has gone missing.\n• The plane was reportedly en route to Lilongwe from Mzuzu when it vanished.\n• Authorities are working to locate the missing aircraft and its passengers.",
        "coordinates": [
            -13.2687204,
            33.9301963
        ]
    },
    {
        "location": "Spain",
        "summary": "• Three people were found guilty and sentenced for racially abusing a Real Madrid player.\n• The incident occurred during a football match in Spain.\n• The trio received punishment for their actions.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• The US has lifted its ban on providing weapons to certain Ukrainian military units.\n• This decision allows these units to receive essential military aid.\n• The move aims to support Ukraine in its ongoing conflict against Russia.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United States",
        "summary": "• The UN Security Council backs a US Israel-Gaza ceasefire plan.\n• US civil rights hero James Lawson dies at 95.\n• A jury begins deliberating in the historic Hunter Biden case.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]