[
    {
        "location": "Australia",
        "summary": "• A sanctuary in Australia has stopped allowing visitors to hug koalas due to concerns about their welfare.\n• The decision was made after some people expressed concerns that hugging the animals could be harmful or stressful.\n• As a result, the sanctuary is now focused on providing a safe and natural environment for its koalas.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Canada",
        "summary": "• \"Australia rejects disabled migrants, tells them they're not welcome.\"\n• \"Canada has become the world's largest car theft hub due to lax laws and lenient sentences.\"\n• \"Lack of enforcement and strict penalties have contributed to Canada's high car theft rate.\"",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "Denmark",
        "summary": "• Copenhagen offers rewards to tourists who participate in cleaning up litter.\n• Tourists can enjoy free coffee as part of Copenhagen's sustainability efforts.",
        "coordinates": [
            55.670249,
            10.3333283
        ]
    },
    {
        "location": "France",
        "summary": "• French President Emmanuel Macron has asked Prime Minister Édouard Philippe to remain in his position amid ongoing political deadlock.\n• The far-right party saw its expected surge in popularity unexpectedly halted during the recent elections, while the left surged forward.\n• Following the elections, a left-leaning alliance won the majority of votes with moderate and socialist candidates holding significant positions.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "India",
        "summary": "• Justin Bieber performed at a high-profile wedding in India.\n• Several Indian wrestlers are aiming to participate in the upcoming Olympic Games.\n• A sexual harassment scandal has affected Indian wrestling, leading to repercussions for some athletes.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• Reformist candidate wins Iran's presidential election\n• New president seeks to improve relations with Western countries\n• President-elect aims for increased diplomatic engagement with the West",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israeli forces launch airstrikes on Gaza City amid renewed tank presence in central areas.\n• Thousands of civilians flee due to escalating violence in Gaza City.\n• The ICC charges Israeli officials with war crimes related to humanitarian crisis in Gaza.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Liberia",
        "summary": "• The President of Liberia has cut their own salary by 40%.\n• This move aims to address economic hardship faced by ordinary citizens.\n• By taking this step, the president demonstrates commitment to helping those struggling financially.",
        "coordinates": [
            5.7499721,
            -9.3658524
        ]
    },
    {
        "location": "South Africa",
        "summary": "• A South African football star was held up at gunpoint.\n• The incident occurred while he was in South Africa.\n• No further details were provided about the event.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• A children's hospital was hit by Russian strikes in Ukraine, killing dozens.\n• The staff worked to clear rubble from a destroyed Kyiv hospital.\n• A Russian missile attack killed 37 people in Ukraine and damaged a children's hospital.\n• Ukrainian attacks on supply lines slowed down the Russian advance in Kharkiv.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• New UK Prime Minister Keir Starmer meets the King.\n• He gives a speech.\n• He starts working.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• The White House defended Joe Biden's health during a heated press conference.\n• A massive wildfire swept through California, forcing an airport to evacuate.\n• Hurricane Beryl struck Texas, killing two people and leaving millions without power.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]