[
    {
        "location": "Belgium",
        "summary": "• Indian Prime Minister Narendra Modi may secure his third term in office according to recent polls.\n• The outcome is uncertain as predictions vary among different surveys.\n• Final results will be determined by voter turnout on election day.",
        "coordinates": [
            50.6402809,
            4.6667145
        ]
    },
    {
        "location": "Canada",
        "summary": "• Robert Pickton died on February 12, 2021.\n• He was found guilty of murdering six women in British Columbia.\n• His farm became known as \"ground zero\" for the serial killings.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• China is planning to send a spacecraft to attempt a historic landing on the far side of the Moon.\n• This mission marks a significant milestone in China's lunar exploration program.\n• The successful completion of this feat would make China one of only three countries to have achieved such a feat after the Soviet Union and the United States.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Estonia",
        "summary": "• Estonia has no contingency plan in place if Ukraine were to fall to Russian forces.\n• The country is concerned about the potential implications of a Ukrainian collapse on regional security.\n• Estonia's lack of a backup plan highlights its vulnerability to Russian aggression.",
        "coordinates": [
            58.7523778,
            25.3319078
        ]
    },
    {
        "location": "France",
        "summary": "• The rise of a young French leader is expected to impact EU politics.\n• The upcoming EU elections may affect Belgium's future existence as a country.\n• These factors will influence European politics in the coming years.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• An anti-Islam activist was stabbed.\n• The incident involved six people being wounded.\n• It occurred in Germany.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Iceland",
        "summary": "• A powerful volcanic eruption in Iceland has created mesmerizing lava rivers.\n• The intense heat from the eruption is melting snow and ice around it.\n• The unique display is attracting tourists to witness the rare natural phenomenon.",
        "coordinates": [
            64.9841821,
            -18.1059013
        ]
    },
    {
        "location": "India",
        "summary": "• Polls predict that India's Prime Minister Narendra Modi may secure his third term in office.\n• The ongoing elections have been marred by arrests, allegations, and controversies involving technology like Artificial Intelligence.\n• Electoral irregularities and concerns about transparency have arisen during the voting process.\n• Despite these challenges, India is set to host the largest democratic exercise globally.\n• Reports indicate instances of electoral malpractices and manipulation during the voting period.\n• The country grapples with severe heatwave conditions, resulting in deaths and water scarcity issues.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel will only agree to a ceasefire in Gaza if its objectives are met, according to PM Netanyahu.\n• Pressure mounts on Netanyahu to secure a ceasefire deal for Gaza.\n• Israel has withdrawn troops from Jabalya, leaving behind devastating damage.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• A former gay man shares his experience with harmful \"conversion therapy\" in Italy.\n• Venice introduces new rules to reduce tourism impact on the city.\n• The same individual describes their \"darkest period\" during the time they underwent conversion therapy.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Mexico",
        "summary": "• The Mexican government has announced that the presidential election will take place on June 6th.\n• The main contenders include Andres Manuel Lopez Obrador, Enrique Peña Nieto, and Josefina Vazquez Mota.\n• The election is expected to have a significant impact on Mexico's economy, security, and social policies.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "South Africa",
        "summary": "• South Africa's ANC is set to form a coalition government due to its reduced majority.\n• The exact date for announcing the South African election results remains unknown.\n• The ANC is likely to lose its majority in parliament for the first time.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "South Korea",
        "summary": "• North Korea has been accused of sending more propaganda balloons carrying anti-South messages and leaflets across the demilitarized zone.\n• The balloons, which have reportedly caused no damage or casualties, have sparked concerns about escalating tensions between the two nations.\n• This is not an isolated incident; similar balloon launches have occurred in recent years as part of ongoing efforts to provoke and intimidate South Korea.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Biden announces that Ukraine can use US weapons for limited strikes in Russia\n• This decision marks an escalation of military support to Ukraine in its conflict with Russia\n• The move aims to deter further Russian aggression and demonstrate strong international backing for Ukraine's sovereignty",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United States",
        "summary": "• Trump's White House bid continues despite lawyer confirming to BBC.\n• Artist is unsurprised by their success as a bestseller.\n• President Biden unveils ceasefire plans for Gaza conflict.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Yemen",
        "summary": "• A joint US-British airstrike killed at least 16 people in Yemen.\n• The Houthis claimed responsibility for an attack on a Saudi-led coalition warship.\n• No casualties were reported from the warship incident.",
        "coordinates": [
            16.3471243,
            47.8915271
        ]
    }
]