[
    {
        "location": "Antarctica",
        "summary": "• Drones capture stunning footage of Antarctic whales performing impressive acrobatic stunts.\n• The aerial views provide unprecedented insight into the whales' behavior and habitat.\n• Researchers hope to use this data to better understand and protect these unique marine creatures.",
        "coordinates": [
            -72.8438691,
            0.0
        ]
    },
    {
        "location": "Brazil",
        "summary": "• Protests erupt in Brazil amid controversy surrounding new abortion laws\n• The legislation has sparked widespread outrage among pro-choice advocates and religious groups alike\n• Demonstrations continue to spread across the country as tensions remain high",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "Burkina Faso",
        "summary": "• A US embassy employee was charged with sexually abusing girls at their residence.\n• The alleged abuse occurred within the confines of the US embassy compound.\n• Authorities have taken swift action against the accused individual.",
        "coordinates": [
            12.0753083,
            -1.6880314
        ]
    },
    {
        "location": "Canada",
        "summary": "• Researchers in Canada have found the ship where Ernest Shackleton died.\n• The ship is believed to be his final resting place.\n• This discovery provides insight into Shackleton's life and legacy.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• A prominent Chinese journalist and women's rights advocate has been imprisoned in a government-led crackdown on civil society.\n• The arrest is part of a broader effort to suppress dissenting voices and maintain control over the narrative.\n• The move has sparked widespread outrage among supporters of press freedom and human rights worldwide.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Cuba",
        "summary": "• Russia sends warships to Havana.\n• This is a gesture of friendship between Russia and Cuba.\n• The visit aims to strengthen ties between both countries.",
        "coordinates": [
            23.0131338,
            -80.8328748
        ]
    },
    {
        "location": "France",
        "summary": "• The French Left has formed a new coalition called \"Popular Front\" to combat the growing influence of the far-right political movement.\n• This move aims to strengthen unity among progressive forces in order to counterbalance the rise of extremist ideologies.\n• By pooling their resources, the Popular Front hopes to increase its electoral prospects and promote a more inclusive and tolerant society.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• Euro 2024 may bring back Germany's successful football team from the past.\n• The tournament could become a \"summer fairytale\" for Germany.\n• There is potential for Germany to relive its past successes during Euro 2024.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Greece",
        "summary": "• Heatwave affects tourists on Greek islands\n• Tips provided for staying safe during heatwaves",
        "coordinates": [
            39.0742,
            21.8243
        ]
    },
    {
        "location": "Iraq",
        "summary": "• A massive fire broke out at an oil refinery in Iraq.\n• The blaze was so intense that it could be seen from afar, causing concern among locals.\n• Emergency services were quickly deployed to contain the fire and prevent further damage.",
        "coordinates": [
            33.0955793,
            44.1749775
        ]
    },
    {
        "location": "Israel",
        "summary": "• US suggests ceasefire path\n• Israeli strikes target Rafah\n• Ceasefire possibility emerges",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• Italy's PM Meloni hosts G-7 leaders amid far-right election wins.\n• A brawl erupts in Italian Parliament before G-7 summit.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Mexico",
        "summary": "• DNA analysis reveals surprising insights into the lives of ancient Mayan children who were sacrificed.\n• The research challenges previous assumptions about the selection process of these children for ritual sacrifices.\n• This discovery sheds new light on the social dynamics of pre-Columbian Mesoamerica.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Niger",
        "summary": "• The President of Niger has been ousted in a military coup.\n• He is no longer protected by immunity as a result.\n• This development raises questions about the future of Niger's government.",
        "coordinates": [
            17.7356214,
            9.3238432
        ]
    },
    {
        "location": "Philippines",
        "summary": "• The Philippines is intensifying its stance on the disputed South China Sea.\n• This comes amid concerns over Chinese aggression in the region.\n• The country faces significant challenges in asserting its claims against powerful rivals.",
        "coordinates": [
            12.7503486,
            122.7312101
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Cyril Ramaphosa is re-elected as President of South Africa.\n• The election marks a significant milestone for the African National Congress (ANC).\n• The outcome signals hope for positive change within the ANC.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Sudan",
        "summary": "• Millions in Sudan face daily struggles to find food due to ongoing war.\n• The UN has called for an end to the siege of Darfur city during the Sudanese civil war.\n• The conflict in Sudan continues to affect civilians, with millions struggling to access basic necessities like food.",
        "coordinates": [
            10.9,
            6.5
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Putin outlines conditions for ceasefire \n• Demands Ukraine surrender four regions to end conflict",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Princess Kate shares positive updates on her ongoing battle with cancer.\n• UK's opposition leader, Keir Starmer, moderates his stance on socialism within the party.\n• Both leaders provide reassurances about their respective health and political directions.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• The Supreme Court's gun ruling has shocked Las Vegas shooting survivors.\n• Demolition began at the Parkland school shooting site amid mixed emotions.\n• Tesla investors approved Elon Musk's $56 billion compensation package despite controversy.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]