[
    {
        "location": "Bangladesh",
        "summary": "• Susannah's grandad was the Governor-General of Bengal during the famine.\n• The famine led to an estimated death toll of millions in Bengal.\n• This historical event has had a lasting impact on Bangladesh's politics and society.",
        "coordinates": [
            -0.2864982,
            36.0514231
        ]
    },
    {
        "location": "Burkina Faso",
        "summary": "• A US embassy worker faces charges for sexually abusing young girls at their residence.\n• The allegations involve exploitation of vulnerable individuals in a diplomatic setting.\n• International pressure is mounting on the US government to address these serious claims.",
        "coordinates": [
            12.0753083,
            -1.6880314
        ]
    },
    {
        "location": "Canada",
        "summary": "• Researchers in Canada have discovered the wreckage of the Endurance, the ship on which Sir Ernest Shackleton's Imperial Trans-Antarctic Expedition ended.\n• The expedition was attempting to cross Antarctica from west to east but became stranded when the ship sank during a storm.\n• This discovery is significant as it sheds light on one of the most infamous maritime disasters in history.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• Beijing offers pandas as ties with Australia thaw\n• China pursues significant expansion of nuclear arsenal, report says",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Cuba",
        "summary": "• Russia sends naval fleet to Havana\n• Fleet arrives in Cuba for diplomatic visit\n• Ships will remain in Cuban waters until September 27th",
        "coordinates": [
            23.0131338,
            -80.8328748
        ]
    },
    {
        "location": "France",
        "summary": "• Jordan Bardella, 28, may become French Prime Minister.\n• French protests express concern over growing far-right influence ahead of elections.\n• Protests emphasize need for social justice amid perceived right-wing shift in politics.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• Police shot a man wielding an axe ahead of the Euros match.\n• The incident sparked alarm among locals.\n• No one was injured during the confrontation.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "India",
        "summary": "• An Indian national accused of a murder-for-hire plot has arrived in New York.\n• India's Prime Minister, Narendra Modi, faces questions about his leadership style following recent electoral setbacks.\n• The government is considering prosecuting author Arundhati Roy under anti-terrorism laws.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• An Iranian national convicted of war crimes has been released from prison as part of a prisoner exchange with Sweden.\n• The prisoner was exchanged by Iran and Sweden as part of a diplomatic agreement.\n• The individual had been serving time for their involvement in wartime atrocities.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Iraq",
        "summary": "• A massive fire broke out at an Iraqi oil refinery.\n• Militants targeted US businesses like KFC due to their involvement in the Gaza conflict.\n• The attacks were meant to express opposition to the US's role in supporting Israel during the Gaza crisis.",
        "coordinates": [
            33.0955793,
            44.1749775
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israeli military 'pauses' operations on Gaza road amid political tensions.\n• Israel permits aid delivery through the Gaza border via a temporary ceasefire.\n• Eight Israeli soldiers die in an attack near Rafah during Eid celebrations, while Gazans face restricted exit routes due to the closure of the Rafah crossing.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• Burns hits century for Italy\n• In the 2026 T20 World Cup qualifier\n• He scored his first century for Italy",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Kenya",
        "summary": "• A Kenyan farmer has emerged as a prominent advocate against climate change, despite its devastating impact on his own livelihood.\n• The farmer's skepticism towards climate change stems from his reliance on traditional farming practices that have been passed down through generations.\n• As a result, he remains unconvinced by scientific evidence linking human activities to rising global temperatures.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Malawi",
        "summary": "• Vice President killed in plane crash.\n• Tributes paid by Malawians.",
        "coordinates": [
            -13.2687204,
            33.9301963
        ]
    },
    {
        "location": "Netherlands",
        "summary": "• Weghorst scores late Netherlands winner\n• Match was against Poland\n• Netherlands wins",
        "coordinates": [
            52.2434979,
            5.6343227
        ]
    },
    {
        "location": "Saudi Arabia",
        "summary": "• At least 14 Hajj pilgrims died due to intense heat.\n• The incident occurred during the annual pilgrimage to Mecca.\n• Authorities are investigating the cause of the deaths.",
        "coordinates": [
            25.6242618,
            42.3528328
        ]
    },
    {
        "location": "Spain",
        "summary": "• Green energy in Spain exceeds demand.\n• Excessive green energy can lead to problems.\n• There may be too much of a good thing with Spain's green energy.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Sweden",
        "summary": "• Avicii's dad misses his son every minute\n• He gets angry with Avicii for leaving \n• He feels sadness and anger simultaneously",
        "coordinates": [
            59.6749712,
            14.5208584
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Peace talks scheduled with conditions of Russian withdrawal from Ukraine.\n• Ukraine faces military challenges, including shortages of troops.\n• Russia demands Ukraine's surrender of four regions to end the conflict.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• A woman completed a 1,000km run in 12 days despite feeling broken.\n• Princess Kate attended her first public event since receiving cancer news.\n• She has made good progress in her cancer fight according to an update from Princess Kate.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• More people turning away from news, report says\n• Biden meets Pope Francis as G-7 wraps up strongly pro-Ukraine summit",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]