[
    {
        "location": "Afghanistan",
        "summary": "• The Taliban's restrictions on women have led to them leading secret online lives.\n• Many Afghani women are using social media platforms to communicate with others.\n• The Taliban is limiting options for women in Afghanistan.",
        "coordinates": [
            33.7680065,
            66.2385139
        ]
    },
    {
        "location": "China",
        "summary": "• A tornado hit a Chinese city, causing debris to fly through the air.\n• Scam artists impersonated police officers to deceive people by claiming they were on China's \"most wanted\" list.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Ethiopia",
        "summary": "• A singer pays tribute to Ethiopia's traditional female vocalists.\n• The singer acknowledges their cultural significance.\n• This recognition aims to promote awareness about Ethiopia's rich musical heritage.",
        "coordinates": [
            10.2116702,
            38.6521203
        ]
    },
    {
        "location": "France",
        "summary": "• French far-right parties are seeking electoral victories amidst concerns over political gridlock.\n• A cyclist was fined for kissing his wife during the Tour de France.\n• The far-right movement has gained significant support in France, sparking questions about its potential spread across Europe.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Hungary",
        "summary": "• Viktor Orban visited Moscow\n• His trip angered EU allies\n• This action upset his European partners",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "Iran",
        "summary": "• Masoud Pezeshkian was elected as Iran's president.\n• The new president has brought hope to women and younger voters in Iran.\n• The newly-elected president will seek to engage with the West.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Last two migrants on their way to Rwanda get bail.\n• Two people found dead in a canal in Dublin.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• At least 16 people killed in air strikes on Gaza schools.\n• Israeli-Hamas talks resume, then adjourn due to disagreements.\n• Scene of Gaza blast sparks shock and horror among witnesses.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Japan",
        "summary": "• Japan has largely abandoned floppy disks due to their obsolescence.\n• Despite this, some industries continue to use floppy disks in certain contexts.\n• This reflects Japan's ongoing reliance on outdated technology.",
        "coordinates": [
            36.5748441,
            139.2394179
        ]
    },
    {
        "location": "Mexico",
        "summary": "• Hurricane Beryl hits Mexico's coast\n• Storm causes widespread damage to infrastructure and properties\n• Emergency services and local authorities work together to respond to the disaster",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Slovakia",
        "summary": "• The Slovak Prime Minister has made his first public appearance after being shot.\n• He was attacked while visiting a town in eastern Slovakia.\n• His condition is stable but still recovering from the wound.",
        "coordinates": [
            48.7411522,
            19.4528646
        ]
    },
    {
        "location": "South Korea",
        "summary": "• Mass sickness reported in South Korea\n• Kimchi suspected as cause\n• Investigation underway",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Spain",
        "summary": "• Thousands celebrated the start of the San Fermin Festival in Pamplona.\n• The event kicked off with traditional festivities.\n• The city was filled with music, dance, and colorful costumes during the celebration.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• An air strike left 100,000 people without power in Ukraine.\n• A lorry collided with a minibus, killing 14 people in Ukraine.\n• Russia destroyed Ukraine's energy sector; now it is being rebuilt sustainably.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• HMS Diamond returns from Red Sea mission\n• UK Prime Minister Keir Starmer meets King and addresses nation\n• Keir Starmer leads landslide Labour win, ending 14 years of Tory rule",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Joe Biden's recent interviews have failed to alleviate Democratic concerns about his physical and mental health.\n• A malfunctioning firework display caused chaos at a Utah event on Independence Day.\n• President Biden acknowledged making mistakes during an interview.\n• Wildfires led to evacuations in parts of California.\n• A man was sentenced to prison for possessing a replica Zelda sword.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]