[
    {
        "location": "Afghanistan",
        "summary": "• The article discusses the challenges faced by women in Afghanistan, particularly during the country's beauty pageants.\n• Despite being considered one of the worst places to be a woman, the beauty pageants serve as an outlet for self-expression and empowerment.\n• In contrast, the Taliban is attempting to reconcile science and religion in addressing climate change, highlighting their efforts towards sustainability and environmental awareness.",
        "coordinates": [
            33.7680065,
            66.2385139
        ]
    },
    {
        "location": "Argentina",
        "summary": "• The Copa America tournament was marred by controversy due to security issues.\n• The incident nearly turned deadly, sparking widespread concern among spectators.\n• As a result, the event was rebranded as the \"party that almost became a tragedy\".",
        "coordinates": [
            -34.9964963,
            -64.9672817
        ]
    },
    {
        "location": "China",
        "summary": "• Asia's richest man hosts lavish star-studded wedding\n• Event features spectacular decorations and performances\n• Critics label it as \"vulgar\" due to excess and extravagance",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "France",
        "summary": "• The Olympic flame arrived in Paris.\n• It was placed at the center of the Bastille Day parade.\n• This event is part of the celebration for Bastille Day.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Gambia",
        "summary": "• The Gambian government has maintained its ban on Female Genital Cutting (FGC), which involves the partial or total removal of external female genitalia.\n• This decision comes amid concerns that the ban may be lifted, allowing FGC to resume in the country.\n• In contrast, some girls have already undergone the procedure despite their parents' efforts to protect them from FGC.",
        "coordinates": [
            13.470062,
            -15.4900464
        ]
    },
    {
        "location": "Germany",
        "summary": "• The German government has implemented a policy requiring certain asylum seekers to participate in labor programs as part of their integration process.\n• This decision aims to provide these individuals with job training, skills development, and social adaptation to better prepare them for employment upon obtaining refugee status.\n• Critics argue that this approach may be overly restrictive and undermine the dignity of refugees who simply wish to pursue legitimate employment opportunities.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Indonesia",
        "summary": "• A previously unknown \"sky island\" rainforest in Indonesia has been preserved due to recent discoveries.\n• The isolated ecosystem is home to unique species that thrive in its high-altitude environment.\n• Scientists hope to learn from this natural wonder and apply their findings to protect other vulnerable ecosystems globally.",
        "coordinates": [
            -2.4833826,
            117.8902853
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Violence breaks out in Dublin over planned asylum seeker housing.\n• Prime Minister condemns violence as \"reprehensible\".\n• Stars remember musician Shane Doherty who passed away suddenly.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel's military is concerned about potential conflict with Lebanon.\n• Israeli airstrikes have killed 90 people in Gaza, including a high-ranking Hamas official.\n• The death toll in Gaza continues to rise as Israel and Hamas negotiate a ceasefire agreement.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• Dozens of Indian workers were rescued from \"slave-like\" conditions in Italy.\n• An Italian court sentenced an Instagram influencer to prison for human trafficking and exploitation.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Serial killer caught after bodies found in Kenya dump.\n• Professors struggling to teach Munro after abuse revelations.\n• President fires hated ministers amid weeks of protests.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "South Korea",
        "summary": "• The popular US-based grocery store chain Trader Joe's has launched a new line of seasonings in South Korea.\n• However, these products have sparked controversy as they contain MSG, which is banned by Korean law due to concerns over its potential health effects.\n• As a result, the products can no longer be legally sold or distributed in the country.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Spain",
        "summary": "• Fans celebrate after Spain's royal welcome in Madrid\n• Royal family arrives at Adolfo Suárez Madrid–Barajas Airport\n• Thousands gather to greet Spanish monarchs",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Syria",
        "summary": "• Many Syrians are fleeing their country due to ongoing conflict.\n• Some have joined African mercenaries to escape instability at home.\n• This trend is becoming increasingly common among displaced Syrian individuals.",
        "coordinates": [
            34.815353599999995,
            38.42307447267531
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Princess Catherine returns to public life after announcing her cancer diagnosis.\n• She will present the trophy to the men's Wimbledon champion.\n• The event showcases the royal family's continued support for tennis in the UK.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• President Trump may make his first public appearance since an assassination attempt.\n• JD Vance has been criticized for supporting Trump in the past but now serves as his running mate.\n• Former Vice President Joe Biden defended his statement that Trump poses a danger to democracy during a recent event.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Zambia",
        "summary": "• Free education policy implemented in Zambia\n• Overcrowding issues arise due to increased enrollment\n• Strain on resources and infrastructure persists",
        "coordinates": [
            -14.5189121,
            27.5589884
        ]
    }
]