[
    {
        "location": "Antarctica",
        "summary": "• Shackleton's Endurance ship gets extra protection\n• The ship is being protected to preserve its historical significance \n• The goal is to preserve it for future generations",
        "coordinates": [
            -79.4063075,
            0.3149312
        ]
    },
    {
        "location": "Australia",
        "summary": "• Teen jumps from jet ski to stop runaway boat.\n• Koala sanctuary stops allowing hugs due to animal welfare concerns.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Brazil",
        "summary": "• Brazil's President Jair Bolsonaro might face charges related to a jewelry transaction.\n• The exact nature of these charges remains unclear at this time.\n• No further details have been released about the incident or potential consequences for Bolsonaro.",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "Canada",
        "summary": "• Canada has become the \"car theft capital of the world\" due to lax laws and lenient sentences.\n• The country is under scrutiny at the NATO summit for allegedly free-riding on other countries' defense efforts.\n• Canada's inaction on climate change and human rights issues contributes to its international reputation as an unreliable partner.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• Heatwaves and floods in China increase awareness about climate change.\n• The country experiences extreme weather conditions due to global warming.\n• Climate change is recognized as an urgent issue by the Chinese government and citizens alike.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Denmark",
        "summary": "• Copenhagen offers free coffee to tourists as part of its sustainable tourism initiative.\n• The city aims to reduce waste and promote eco-friendly practices through this program.\n• By providing free coffee, Copenhagen hopes to attract visitors while minimizing environmental impact.",
        "coordinates": [
            55.670249,
            10.3333283
        ]
    },
    {
        "location": "France",
        "summary": "• The French Socialist party is eyeing the Prime Minister position despite ongoing political deadlock.\n• The recent French election resulted in a surprise outcome due to various factors.\n• A left-leaning coalition has emerged as a dominant force in French politics following the election results.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Iran",
        "summary": "• Iran's new president will prioritize domestic development over international relations.\n• The president aims to reduce Iran's dependence on oil exports by increasing non-oil revenue.\n• The administration plans to implement policies that benefit the middle class, including increased subsidies and job creation initiatives.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Ireland",
        "summary": "• The Irish Prime Minister is set to intervene on behalf of an Irish woman who faces charges in Dubai.\n• This move aims to ensure her safety and secure fair treatment during the legal proceedings.\n• The intervention may also facilitate communication between authorities to resolve the matter efficiently.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• Health care in Gaza City is collapsing due to an Israeli offensive.\n• The crisis has forced thousands to flee their homes.\n• A new Israeli operation in Gaza City is underway.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "South Korea",
        "summary": "• South Korean politician blames women for rising male suicides.\n• Gautam Gambhir has transitioned from being an aggressive batsman to becoming a strategic coach.\n• A South Korean politician has made controversial remarks about men committing suicide due to women.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Spain",
        "summary": "• Protesters in Barcelona used water guns to attack tourists.\n• The protest was sparked by frustration towards tourists.\n• The incident highlights tensions between locals and visitors in popular tourist destinations.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• A Kyiv hospital was attacked by missiles.\n• The US will be providing more air defenses to protect against such attacks.\n• The attack resulted in the deaths of 37 people, including children.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United States",
        "summary": "• Donald Trump has challenged Joe Biden to a debate without moderators.\n• The US has discovered an alleged Russian \"bot farm\".\n• A New York bridge is stuck open due to extreme heat.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]