[
    {
        "location": "Australia",
        "summary": "• Australia's renowned \"Space Gandalf\" astronomer passes away at 62.\n• The late scientist was known for his groundbreaking discoveries in space exploration and astronomy.\n• His legacy continues to inspire new generations of scientists and explorers.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "France",
        "summary": "• Joe Biden is set to deliver a speech in France, emphasizing his commitment to defending democracy.\n• He will participate in commemorating the 80th anniversary of D-Day alongside world leaders and veterans.\n• This event highlights Biden's stance on democracy, contrasting with that of former President Donald Trump.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Greece",
        "summary": "• Dr. Michael Mosley is missing in Greece\n• He is known for popularizing the 5:2 diet\n• Authorities are searching for him",
        "coordinates": [
            39.0742,
            21.8243
        ]
    },
    {
        "location": "India",
        "summary": "* Modi will be sworn in as India's Prime Minister on Sunday.\n* The opposition accuses Modi of being involved in a stock market scam.\n* A gunman opened fire at the US Embassy in Lebanon, but was shot by the army before any harm was done.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Irish economy returns to growth\n• Pit bull terrier shot by Irish police after two injured\n• Irish polls open for local and EU elections",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• The United States is urging Israel to be more transparent about its actions regarding the recent strike on a school in Gaza.\n• Prime Minister Benjamin Netanyahu will speak before a joint meeting of both houses of Congress in July.\n• The UN has accused Israel of using American-made ammunition in the attack on a UN school that resulted in the deaths of many innocent children.\n• A deadline has been set for Israel to improve their treatment of detained Palestinians or face international consequences.\n• Detention centers in Israel have been reported as having committed human rights violations, including torture, abuse, and mistreatment of prisoners.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Israel may launch an attack on Lebanon amid escalating violence with Hezbollah.\n• US President Joe Biden visits France to commemorate D-Day, highlighting differences from predecessor Donald Trump.\n• Tensions between Israel and Hezbollah escalate, threatening regional stability.",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Myanmar",
        "summary": "• The military junta has inflicted widespread human rights abuses and political repression on its citizens.\n• The economic sanctions imposed by international governments have led to a significant decline in trade and investment.\n• The ongoing violence and instability have resulted in the displacement of thousands of people and the destruction of infrastructure.",
        "coordinates": [
            17.1750495,
            95.9999652
        ]
    },
    {
        "location": "Netherlands",
        "summary": "• The European Union parliamentary election has commenced in the Netherlands.\n• A recent exit poll indicates a close competition between parties vying for leadership.\n• The outcome remains uncertain due to the unpredictable nature of the contest.",
        "coordinates": [
            52.2434979,
            5.6343227
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Cyril Ramaphosa believes unity government is SA's best option.\n• He advocates for unity among political parties to address challenges.\n• A unified government would benefit the country economically and socially.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "South Korea",
        "summary": "• North Korea launched balloons carrying propaganda materials into South Korea.\n• Activists in South Korea responded by sending K-pop music to counter the propaganda.\n• The balloon incident highlights tensions between the two nations.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Ukrainian President Zelensky calls D-Day veteran a hero\n• Zelensky honors D-Day veteran as a hero\n• Power outages in Ukraine due to Russian airstrikes on energy facilities",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Refugees on a remote UK island discuss their experiences in interviews with the BBC.\n• Two UK judges severed ties with Hong Kong's judicial system due to political reasons.\n• World War II veterans commemorate the 80th anniversary of D-Day.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Hunter Biden's ex-girlfriend found a gun and panicked.\n• Eleven people were sent to the hospital due to extreme heat during an Arizona Trump rally.\n• Israeli Prime Minister Benjamin Netanyahu will be addressing the U.S. Congress on July 24th.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]