[
    {
        "location": "Canada",
        "summary": "• Canadian researchers discover wreckage of Sir Ernest Shackleton's ship.\n• The discovery sheds light on the famous Antarctic explorer's final moments.\n• The finding provides valuable insights into Shackleton's tragic demise.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "Cuba",
        "summary": "• Cuban officials welcome Russian naval fleet in Havana\n• Russian warships arrive in Havana\n• Strengthening ties between Russia and Cuba",
        "coordinates": [
            23.0131338,
            -80.8328748
        ]
    },
    {
        "location": "France",
        "summary": "• Kylian Mbappé encourages young people to vote against extremism.\n• Paris rehearses its Olympic opening ceremony on the Seine River.\n• The city prepares for the upcoming event by practicing the opening ceremonies.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• A man wielding an axe was shot by police in Hamburg.\n• The incident sparked alarm among residents and authorities alike.\n• The motive behind the attack remains unknown at this time.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "India",
        "summary": "• An exam sparks national outrage due to alleged cheating.\n• The incident is widely condemned by Indian citizens.\n• Authorities investigate the matter.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• Iran has given a Nobel laureate a new prison sentence\n• The sentence was imposed by an Iranian court\n• The exact duration of the sentence is unknown",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel claims that the Rafah attack is nearing completion, potentially shifting the dynamics of the ongoing conflict.\n• In a show of force, Jerusalem police have violently dispersed protesters calling for Prime Minister Benjamin Netanyahu's resignation.\n• Despite dissolving the war cabinet, Netanyahu has stated his intention to exclude the far-right factions from any subsequent decision-making processes.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• A parkour group's attempted stunt damaged an historic Italian building.\n• The incident occurred during their practice session at the site.\n• Authorities have launched an investigation to determine responsibility for the damage.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Kenya has scrapped its controversial bread tax amidst widespread protests.\n• The decision comes after demonstrators were teargassed by security forces during clashes with authorities.\n• The move is seen as a major concession to anti-government sentiment in the country.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Mexico",
        "summary": "• The United States Department of Agriculture (USDA) has suspended avocado inspections in a specific Mexican state due to security concerns.\n• This decision was made to address potential threats related to food safety or other issues that could impact public health.\n• As a result, the quality control process for avocados will be temporarily halted until further notice.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "North Korea",
        "summary": "• NK soldiers cross border\n• Warning shots fired by South Korean military\n• Tensions escalate between two nations",
        "coordinates": [
            40.3736611,
            127.0870417
        ]
    },
    {
        "location": "Philippines",
        "summary": "• Extreme heat is taking a devastating toll on overcrowded prisons in the Philippines.\n• The sweltering conditions are exacerbating existing health issues among inmates, who often lack access to proper healthcare.\n• As temperatures soar, authorities face growing pressure to address the crisis and find solutions to mitigate its impact on prisoners' well-being.",
        "coordinates": [
            12.7503486,
            122.7312101
        ]
    },
    {
        "location": "Portugal",
        "summary": "• Portugal secures last-minute victory over Czech Republic\n• The match ended with a dramatic turnaround in favor of Portugal\n• This win marks a significant boost to Portugal's morale ahead of future competitions",
        "coordinates": [
            39.6621648,
            -8.1353519
        ]
    },
    {
        "location": "Singapore",
        "summary": "• A huge oil spill has blackened Singapore's picturesque beaches.\n• The incident has affected the environment and tourism in the area.\n• Efforts are underway to clean up the spill and minimize its impact on local ecosystems.",
        "coordinates": [
            1.357107,
            103.8194992
        ]
    },
    {
        "location": "South Africa",
        "summary": "• South African walls feature artwork depicting the \"Big Five\" wildlife species.\n• The artworks showcase the country's rich cultural heritage through its love for nature.\n• This unique blend of culture and conservation promotes appreciation for South Africa's natural beauty.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Thailand",
        "summary": "• Thailand passes landmark bill legalizing same-sex marriage\n• The legislation marks a significant step forward in LGBTQ+ rights\n• Same-sex couples can now legally marry and access equal rights and benefits",
        "coordinates": [
            7.4931858,
            124.724704
        ]
    },
    {
        "location": "USA",
        "summary": "• Biden faces backlash regardless of his approach to immigration policy.\n• The CEO of Boeing faced questioning from lawmakers and victims.\n• A secret service agent was robbed during a fundraiser for Biden.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Kyiv celebrated its first Pride parade since the invasion, with LGBTQ+ soldiers demanding equal rights.\n• Despite being away from war zones, Ukrainian soccer players prepare to face challenges on the field.\n• The country's athletes continue to perform under difficult circumstances.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    }
]