[
    {
        "location": "Australia",
        "summary": "• Fungus kills frogs.\n• Scientists suggest homemade saunas may help save them.\n• Fungus causes frog deaths, with saunas potentially offering solution.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Belarus",
        "summary": "• Belarus has granted amnesty to five political prisoners\n• This is a rare occurrence in the country\n• The move suggests possible improvements in human rights conditions",
        "coordinates": [
            53.4250605,
            27.6971358
        ]
    },
    {
        "location": "Brazil",
        "summary": "• Brazil blocks Meta from using social media posts to train AI.\n• This move is part of an ongoing effort to regulate tech giants in Brazil.\n• The ban aims to protect users' privacy rights and prevent misuse of personal data.",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "France",
        "summary": "• French PM says only far-right parties can form a majority in upcoming elections.\n• Pétanque event in Marseille hides deep-seated political divisions before Sunday's vote.\n• Deep-seated political divisions exist in Marseille ahead of Sunday's election.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Iran",
        "summary": "• The election of Iran's new president will take place soon.\n• The role of the Iranian President includes managing the country's government.\n• A leader with a strong background in politics or public service is likely to be chosen as the next President.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israeli military targets Hezbollah leader in Lebanon.\n• Hezbollah commander killed in Israeli airstrike.\n• Conflict escalates between Israel and Hezbollah.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Jamaica",
        "summary": "• Powerful Hurricane Beryl approaches Jamaica\n• Hurricane Beryl moves closer to Jamaica\n• Hurricane Beryl passes near Jamaica",
        "coordinates": [
            18.1850507,
            -77.3947693
        ]
    },
    {
        "location": "Japan",
        "summary": "• Cup Noodles introduces s'more-flavored ramen\n• The new flavor combines traditional Japanese ramen with American campfire treats \n• S'more-flavored ramen is available in stores now",
        "coordinates": [
            36.5748441,
            139.2394179
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Public outcry prompts pay rise freeze for Kenyan Members of Parliament.\n• Freeze is implemented to address public discontent over perceived high salaries.\n• Decision aims to restore trust in government's commitment to transparency and accountability.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Panama",
        "summary": "• The US is funding deportations from Panama\n• This is part of an effort to crack down on migrants in Panama\n• The goal is to reduce the number of people entering or staying in Panama illegally",
        "coordinates": [
            8.559559,
            -81.1308434
        ]
    },
    {
        "location": "Portugal",
        "summary": "• Over 30 passengers injured in severe turbulence\n• Diverted flight from Europe to Brazil\n• No fatalities reported",
        "coordinates": [
            39.6621648,
            -8.1353519
        ]
    },
    {
        "location": "Saint Lucia",
        "summary": "• Worst hurricane ever described by Union Island resident\n• Almost entire island left homeless after Hurricane Beryl",
        "coordinates": [
            13.8250489,
            -60.975036
        ]
    },
    {
        "location": "South Africa",
        "summary": "• South African zoos are using in vitro fertilization (IVF) to breed endangered white rhino species.\n• The goal is to increase their population and reduce poaching threats.\n• This method allows conservationists to carefully select breeding partners for optimal genetic diversity.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Spain",
        "summary": "• The world's oldest cave art has been discovered in Spain, featuring depictions of humans and pigs.\n• This 51,000-year-old painting is believed to be one of the earliest scenes ever depicted using art.\n• The discovery provides valuable insights into prehistoric human culture and artistic expression.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Syria",
        "summary": "• Syrian forces clashed with Turkish troops.\n• The conflict began as a response to anti-migrant riots in Turkey.\n• The incident highlights rising tensions between the two nations.",
        "coordinates": [
            34.815353599999995,
            38.42307447267531
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Ukraine accuses Russia of using brutal tactics in its efforts to seize territory.\n• Public support for Hamas is waning due to the ongoing conflict in Gaza.\n• In Kyiv, hidden and missing monuments symbolize resistance against war.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• The UK's general election is underway amid controversy surrounding the campaign trail.\n• Jewish voters who previously deserted the Labour party due to anti-Semitism are returning in large numbers.\n• Meanwhile, the ruling Conservative party faces an existential threat as they struggle to maintain their grip on power.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Biden faces increasing pressure to withdraw from his presidential bid.\n• Blazing wildfires have led to evacuations in California.\n• The Supreme Court has granted Trump temporary immunity in several cases.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]