[
    {
        "location": "Brazil",
        "summary": "• Uncontacted indigenous tribe in Brazil faces threat from loggers\n• Government has failed to intervene or protect the tribe's territory",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "Burkina Faso",
        "summary": "• Military rule extended in Burkina Faso by five years\n• No additional information available about other developments or context surrounding this decision",
        "coordinates": [
            12.0753083,
            -1.6880314
        ]
    },
    {
        "location": "China",
        "summary": "• China seeks to counterbalance Japan and South Korea's strengthening ties with the US\n• US influence has waned in China due to declining trust and increasing assertiveness from Beijing",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Colombia",
        "summary": "• Colombia has started exploring what is considered the \"holy grail\" of shipwrecks.\n• The shipwreck, located off the coast of Colombia, holds significant historical value due to its cargo of gold, silver, and other precious items.\n• This discovery could provide valuable insights into maritime history and trade routes in the region.",
        "coordinates": [
            4.099917,
            -72.9088133
        ]
    },
    {
        "location": "France",
        "summary": "• The French government faces uncertainty as Prime Minister Édouard Philippe struggles to contain the rising popularity of far-right leader Marine Le Pen.\n• Despite his efforts, Philippe's leadership is being challenged by Le Pen's growing influence among voters.\n• A potential showdown between the two politicians could reshape the country's political landscape.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• The far-right party in Germany is shifting focus towards European elections.\n• They are leaving the German AfD to participate in European parliamentary polls instead.\n• This move indicates their desire to expand influence across the continent.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "India",
        "summary": "• A fire at a Delhi hospital resulted in the death of newborn babies.\n• An arcade in India caught on fire, causing damage and injury to patrons.\n• The same type of fire occurred again at another Delhi hospital, resulting in fatalities among newborns.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Indonesia",
        "summary": "• A devastating landslide in Papua has left 670 people feared buried.\n• The United Nations is concerned about the impact on the affected community.\n• Search and rescue efforts are underway to locate survivors.",
        "coordinates": [
            -2.4833826,
            117.8902853
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Ireland, Norway, and Spain will recognize Palestine as a sovereign state.\n• This decision aims to support the peace process between Israelis and Palestinians.\n• The move may lead to increased diplomatic engagement and cooperation between the three countries and Palestine.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• An Israeli airstrike targeted Rafah in response to a Hamas rocket barrage.\n• The conflict escalated with three Israeli hostages found dead in Gaza and a rocket attack on Tel Aviv.\n• The Associated Press' Gaza live feed was reinstated after being suspended due to security concerns.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Mexico",
        "summary": "• A suspected member of the Sinaloa cartel has been extradited from Mexico to the United States\n• The individual faces charges related to drug trafficking and other criminal offenses in the US\n• Their extradition marks another significant cooperation between Mexican and American law enforcement agencies",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• 160 villagers were reportedly taken during a deadly raid in Nigeria.\n• The number of fatalities remains unknown due to lack of official confirmation.\n• The reason behind the raid is currently unclear.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "Papua New Guinea",
        "summary": "• At least 670 people remain unaccounted for after a massive landslide hit Papua New Guinea.\n• Authorities face challenges in locating survivors amidst challenging terrain and harsh weather conditions.\n• The government is working with local communities to search for missing persons and provide aid to affected families.",
        "coordinates": [
            -5.6816069,
            144.2489081
        ]
    },
    {
        "location": "Qatar",
        "summary": "• A recent Doha-Dublin flight experienced turbulence, leaving 12 passengers injured.\n• The incident caused panic among passengers due to sudden air pockets.\n• Emergency services attended to those affected upon landing.",
        "coordinates": [
            25.3336984,
            51.2295295
        ]
    },
    {
        "location": "South Africa",
        "summary": "• The African National Congress (ANC) aims to win the upcoming election.\n• The party faces challenges due to internal divisions and economic issues.\n• The outcome remains uncertain due to various factors.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Sudan",
        "summary": "• At least 130 people died in a Sudanese hospital due to shortages of medical supplies and oxygen during a city siege.\n• The situation was exacerbated by an ongoing political crisis and economic instability in Sudan.\n• The hospital's supply chain was severely disrupted due to lack of access to essential resources.",
        "coordinates": [
            10.9,
            6.5
        ]
    },
    {
        "location": "USA",
        "summary": "• Tornadoes and storms left 15 people dead across the central United States.\n• The Libertarians booed President Donald Trump during his speech at their convention.\n• Three missionaries from an Oklahoma-based organization were killed in Haiti.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Ukraine",
        "summary": "1. The BBC reports on the impact of a strike in Kharkiv, Ukraine.\n2. Ukrainian drone operators, inspired by the TV show Peaky Blinders, use drones to defend their city from enemy attacks.\n3. At least six people died and 40 others were injured after a Russian airstrike hit a market in Kharkiv, Ukraine.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    }
]