[
    {
        "location": "Australia",
        "summary": "• Beloved Australian actress and Neighbours star Janet Andrewartha has passed away.\n• Details of her death are currently unavailable\n• No further information is available on the circumstances surrounding her passing.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Canada",
        "summary": "• Canada's top court has ruled that the government owes First Nations compensation for treaty breaches.\n• This landmark decision affirms the rights of Indigenous peoples to self-determination and redress for historical injustices.\n• The ruling paves the way for further discussions and negotiations between the federal government and First Nations over treaty obligations.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "Ethiopia",
        "summary": "• A boat carrying passengers has capsized in Ethiopia's Lake Tana, resulting in a fatal accident.\n• At least 12 people have died in the incident and several others are injured or missing.\n• The exact circumstances surrounding the disaster are still being investigated.",
        "coordinates": [
            10.2116702,
            38.6521203
        ]
    },
    {
        "location": "France",
        "summary": "• France's high-speed train network has been repaired after a series of arson attacks.\n• Despite some grumbles, the Olympic spirit is alive in Paris despite challenges during the Games.\n• The Olympic event in Paris drew an A-list celebrity crowd, with Simone Biles making an appearance.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "India",
        "summary": "• US Vice President Kamala Harris's approval ratings have declined in India.\n• The Indian public's enthusiasm for her has cooled down due to various factors including COVID-19 response and diplomatic issues.\n• Harris's popularity among Indians, which once saw her as a role model, is no longer the same.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Notable Irish author passes away\n• Cause of death is not specified in this report \n• (no additional details provided about Edna O'Brien's passing, only her age at time of death)",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israelis face a high risk of another war with various groups due to ongoing tensions and rocket attacks.\n• Israeli airstrikes have targeted Lebanon after a rocket strike, sparking fears of an all-out conflict.\n• There have been multiple attacks in Gaza and the Golan Heights that killed over 40 people, many of them children.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Tensions between Hezbollah and Israel are escalating, raising concerns of a potential large-scale conflict.\n• Hezbollah, a Lebanese Shia Islamist political party and military organization, has been involved in previous battles with Israel, but the situation now appears more volatile than ever.\n• The potential war could have severe consequences for Lebanon's already fragile economy and infrastructure.",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Mexico",
        "summary": "• Mexican authorities were not informed about the arrest of top cartel leaders until after they had been taken into US custody.\n• This lack of communication meant that Mexico was unable to take advantage of the opportunity to capture or dismantle the remaining members of these cartels.\n• The situation has raised questions about the cooperation and coordination between US and Mexican law enforcement agencies.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Norway",
        "summary": "• Many Norwegians feel guilty about their country's colonial past.\n• Not everyone in Norway shares these feelings of guilt.\n• Guilt over historical actions is a complex issue within Norwegian society.",
        "coordinates": [
            64.5731537,
            11.52803643954819
        ]
    },
    {
        "location": "South Sudan",
        "summary": "• South Sudan's Olympic team suffered an embarrassment as the wrong national anthem was played before one of their matches.\n• The mix-up occurred during the 2023 World University Games, where a South Sudanese athlete competed in shooting events.\n• The incorrect national anthem was reportedly used for multiple countries, sparking confusion among participants.",
        "coordinates": [
            7.8699431,
            29.6667897
        ]
    },
    {
        "location": "USA",
        "summary": "• A massive California wildfire is consuming 5,000 acres per hour.\n• The US and Japan are strengthening their military alliance with new cooperation plans.\n• Comparisons between Trump and Biden's immigration policies are highlighted in 12 charts.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Ukraine",
        "summary": "Here are three key points about Ukraine:\n\n• US and European countries have provided drones to support Ukraine's military efforts.\n• F-16 fighter jets have been delivered to Ukraine, but their impact on the conflict remains uncertain.\n• The use of advanced technology in Ukraine suggests a shift towards more hybrid warfare approaches.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "Venezuela",
        "summary": "• Opposition leader appears to have won Venezuelan presidential election.\n• Election results show a significant lead for the opposition candidate over President Maduro.\n• Exit polls suggest a wide margin of victory for the opposition, although official results have not been released.",
        "coordinates": [
            8.0018709,
            -66.1109318
        ]
    }
]