[
    {
        "location": "Brazil",
        "summary": "• A previously unknown indigenous tribe was discovered in the Amazon rainforest.\n• Loggers have been encroaching on their territory despite the presence of environmental laws protecting it.\n• The Brazilian government has failed to take action to protect the tribe or their land.",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "Chile",
        "summary": "• A Chilean firefighter has been arrested in connection with a devastating fire that claimed 137 lives.\n• The blaze occurred at a shopping mall in Santiago, resulting in one of the country's deadliest fires in recent history.\n• Authorities have launched an investigation into the cause of the fire, which remains unclear at this stage.",
        "coordinates": [
            -31.7613365,
            -71.3187697
        ]
    },
    {
        "location": "China",
        "summary": "• The US has lost its popularity in China.\n• Its influence is no longer as strong as it once was.\n• This change may be attributed to various factors.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Germany",
        "summary": "• The far-right movement is gaining popularity in European elections.\n• It is abandoning support for the German party Alternative for Germany (AfD).\n• This shift may lead to significant political changes in the region.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Haiti",
        "summary": "• Kenyan police will arrive in Haiti within three weeks.\n• US missionaries were killed in Haiti due to gang violence.\n• Three missionaries from an Oklahoma-based group were fatally shot in Haiti.",
        "coordinates": [
            19.1399952,
            -72.3570972
        ]
    },
    {
        "location": "India",
        "summary": "1. A fire in an Indian games arcade killed 24 people.\n2. The incident occurred due to a possible short circuit or electrical issue.\n3. The victims included both children and adults, with several injured still hospitalized.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Ireland, Norway, and Spain recognize Palestine as a sovereign state.\n• Three men appear in court regarding a €2.1 million cannabis seizure.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israeli activists clash over Gaza-bound aid convoys.\n• Three more Israeli hostages found dead in Gaza; negotiations ongoing.\n• Israel reinstates Associated Press' Gaza live feed after previous shutdown.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Netherlands",
        "summary": "• Nicki Minaj's concert in Amsterdam was cancelled due to her arrest.\n• The concert cancellation occurred after her detention by Dutch authorities.\n• No further details about the reason for the arrest have been disclosed.",
        "coordinates": [
            52.2434979,
            5.6343227
        ]
    },
    {
        "location": "Niger",
        "summary": "• A military junta seized power in Niger, led by Colonel Mamadou Bazoumoun Koyari.\n• The new government faces significant challenges in maintaining stability, including addressing economic issues, regional tensions, and international reactions.",
        "coordinates": [
            17.7356214,
            9.3238432
        ]
    },
    {
        "location": "Papua New Guinea",
        "summary": "• Rescue efforts underway in Papua New Guinea following a deadly landslide that has trapped villagers.\n• Emergency teams racing against time to reach isolated communities affected by the disaster.\n• Multiple landslides reported in the region, causing widespread destruction and loss of life.",
        "coordinates": [
            -5.6816069,
            144.2489081
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Cynthia initially supported Nelson Mandela.\n• She is now withdrawing her support from his successors.\n• The reason for this change in stance is unknown.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "USA",
        "summary": "• A murder case involving a politician and an astrologer led to changes in the law.\n• Clive Myrie is disillusioned with the US due to mass shootings.\n• Disney songwriter Richard M Sherman has died at age 95.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• A Russian airstrike hits a Kharkiv supermarket, killing two people.\n• The attack occurs amid ongoing conflict between Russia and Ukraine.\n• Details about other victims or damage are unknown.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    }
]