[
    {
        "location": "France",
        "summary": "• French authorities have arrested a Russian-Ukrainian individual accused of manufacturing explosive devices.\n• The suspect was detained by law enforcement officials in connection with alleged bomb-making activities.\n• Further details regarding the investigation and potential motivations behind the suspect's actions remain unclear at this time.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "India",
        "summary": "• Allies support PM Modi despite electoral losses.\n• India has faced setbacks in its election process.\n• The country's low caste groups have influenced the outcome.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• The United Nations' nuclear watchdog agency is urging Iran to collaborate on its nuclear program.\n• Iran has been accused of pursuing illicit nuclear activities, sparking concerns about regional stability.\n• International pressure is mounting on Iran to comply with international standards regarding nuclear development.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel launches military operation in central Gaza amid escalating tensions.\n• Israeli nationalists march through Jerusalem's Old City amidst rising nationalism.\n• Biden questions whether Israel is committing war crimes in conflict with Hezbollah.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Japan",
        "summary": "• Asahi Group Holdings plans to increase its sales in Japan by targeting young people aged 18 to 24 with new products such as low-alcohol beverages.\n• The company will launch \"Asahi Brew Works\" to appeal to younger generations who prefer healthier lifestyles.\n• To reach this demographic, Asahi will focus on digital marketing strategies like social media campaigns and influencer partnerships.",
        "coordinates": [
            36.5748441,
            139.2394179
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• A gunman opened fire on the US embassy in Beirut.\n• The attack was met with swift response from the Lebanese military.\n• Both the gunman and the soldier were killed in the ensuing exchange of gunfire.",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Mexico",
        "summary": "• Israel faces internal conflicts amid growing dissent from lawmakers.\n• Prime Minister struggles to maintain unity in the government amidst these challenges.\n• The situation may lead to instability and potential changes within the administration.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Qatar",
        "summary": "• A man was arrested in Qatar as part of a \"Grindr sting\" operation.\n• He has been sentenced for his involvement in the incident.\n• The details of the case remain unclear at this time.",
        "coordinates": [
            25.3336984,
            51.2295295
        ]
    },
    {
        "location": "Slovakia",
        "summary": "• Slovak PM accuses opposition of spreading hatred\n• Shooting incident blamed by PM on opposition's actions\n• No further details provided",
        "coordinates": [
            48.7411522,
            19.4528646
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "- Royal Air Force flypast honors D-Day veterans during their trip to France.\n- British veterans celebrate being freed from Nazi occupation in Normandy.\n- The tallest waterfall in China is secretly maintained through hidden pipes, officials reveal.\n- The King's portrait appears on UK currency, marking his reign as monarch.\n- Labour leader Keir Starmer and Conservative politician Rishi Sunak engage in their first televised debate ahead of the UK general elections.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "•\tBoeing launches long-delayed astronaut capsule.\n•\tBiden faces criticism from Republicans over his border policy.\n•\tAir rescue team saves man who fell off a cliff in Los Angeles.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]