[
    {
        "location": "Afghanistan",
        "summary": "• The Taliban is trying to reconcile science and religion in addressing climate change.\n• They aim to find ways to reduce greenhouse gas emissions and slow down global warming within an Islamic framework.\n• This effort involves exploring traditional practices that can help mitigate the effects of climate change while staying true to their religious beliefs.",
        "coordinates": [
            33.7680065,
            66.2385139
        ]
    },
    {
        "location": "Canada",
        "summary": "• Abuse revelations spark debate on teaching Alice Munro's work in Canadian classrooms\n• Professors struggle to balance literary merit with sensitivity towards students who may have experienced similar trauma\n• Some educators consider omitting certain stories or using alternative materials to avoid triggering harmful emotions",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "Colombia",
        "summary": "• Núñez had an altercation with Colombian fans during a match.\n• The incident led to tension between him and some spectators.\n• He faced criticism from both the fans and media.",
        "coordinates": [
            4.099917,
            -72.9088133
        ]
    },
    {
        "location": "Ecuador",
        "summary": "• Five people have been imprisoned in relation to the murder of an Ecuadorian presidential candidate.\n• The incident has sparked widespread outrage among Ecuadorians and human rights groups.\n• The case is being closely monitored by international organizations due to its political implications.",
        "coordinates": [
            -1.3397668,
            -79.3666965
        ]
    },
    {
        "location": "Egypt",
        "summary": "• 4,000-year-old axe-heads have been discovered.\n• The axe-heads were sent to a museum.\n• The source of the axe-heads remains unknown.",
        "coordinates": [
            26.2540493,
            29.2675469
        ]
    },
    {
        "location": "France",
        "summary": "• Three French rugby players have been charged with rape.\n• The incident allegedly occurred during their tour of Argentina.\n• They will face trial to determine their guilt or innocence.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• Germany forces some asylum seekers to work.\n• Asylum seekers prefer real jobs over forced labor.\n• Forced work affects asylum seekers' job prospects in Germany.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Hungary",
        "summary": "• Orban claims to be a peacemaker without a plan.\n• He lacks a clear strategy for resolving conflicts globally.\n• His actions may be driven by personal interests rather than a genuine desire for peace.",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "India",
        "summary": "• The Ambani family celebrated with former Prime Ministers, film stars, and athletes.\n• Asia's richest person hosted a lavish wedding featuring Bollywood stars and other celebrities.\n• Two brothers from a wealthy business family got married in a highly publicized event.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israeli strikes kill 90 people in Gaza, including Hamas military chief.\n• Israeli military claims to have failed to protect Gaza border town.\n• Israel and Hamas close to ceasefire deal.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Kenyan President has fired his unpopular cabinet members after weeks of public unrest.\n• The move comes as part of efforts to address widespread discontent among citizens.\n• This development is expected to bring about positive change in the country's governance structure.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• At least 10 children were killed when a building collapsed at a school in Lagos.\n• The incident occurred during a morning assembly at the school.\n• Rescue efforts are ongoing to locate any survivors trapped under the rubble.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "South Korea",
        "summary": "• U.S.-China rivalry extends to music industry with competition over who can produce better K-pop songs.\n• In South Korea, popular Trader Joe's seasoning is banned due to its high salt content being seen as unhealthy by the Korean government.\n• The ban on Trader Joe's seasoning has led to widespread outrage among consumers in South Korea.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Spain",
        "summary": "• Three countries vie for talented player Lamine Yamal.\n• Spaniards believe they have strong chance to win Euro 24 title.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Zelensky visits Ireland\n• Taoiseach vows to visit Kyiv\n• Ukraine-Ireland relations strengthened through these trips",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Princess Kate to present trophy to men's Wimbledon winner\n• Palace announces royal presence at tennis tournament\n• Traditional Wimbledon ceremony to take place on Centre Court",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Shots were fired at a Donald Trump rally; Trump was rushed offstage and the attacker died.\n• Dr. Ruth Westheimer, a celebrity sex therapist, passed away at 96 years old.\n• Alec Baldwin's Rust trial has been dismissed due to hidden evidence.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Zimbabwe",
        "summary": "• A massacre survivor refuses to forgive Zimbabwean President Robert Mugabe's soldiers.\n• The survivor seeks justice for the atrocities committed by the soldiers.\n• The incident highlights ongoing human rights abuses in Zimbabwe under Mugabe's regime.",
        "coordinates": [
            -18.4554963,
            29.7468414
        ]
    }
]