[
    {
        "location": "Brazil",
        "summary": "• Heavy rainfall caused widespread flooding in southern Brazil\n• Thousands of people affected by the disaster\n• Rescue efforts underway to reach stranded communities",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "France",
        "summary": "• A precocious prime minister faces competition from a far-right phenom in France.\n• The prime minister's ability to hold off the challenger is uncertain due to their differing political ideologies.\n• The outcome will significantly impact French politics.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Haiti",
        "summary": "• Gang violence in Haiti resulted in the deaths of US missionaries.\n• Three missionaries from an Oklahoma-based group were among those killed.\n• The US is trying to downplay its involvement in Haiti despite its visible military presence.",
        "coordinates": [
            19.1399952,
            -72.3570972
        ]
    },
    {
        "location": "India",
        "summary": "• A politician's involvement in an astrologer's murder led to a significant legal change.\n• A heartwarming story about Indian sisters was showcased at the Cannes Film Festival.\n• No additional information is available regarding this headline as it appears to be a duplicate entry.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Israel",
        "summary": "• Conflict escalates as Israeli activists clash over Gaza-bound aid convoys and three Israeli hostages are found dead in Gaza.\n• Israel reverses its decision to shut down the Associated Press news agency's Gaza live feed.\n• The number of remaining hostages in Gaza is unknown after a Hamas attack on Israel, while Israel urges negotiators to continue hostage talks and faces increasing international isolation.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Kenyan police will deploy to Haiti within three weeks.\n• The move aims to support local authorities in addressing security concerns.\n• The deployment demonstrates regional solidarity and cooperation.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Mexico",
        "summary": "• A man discovered 30,000-year-old mammoth bones in his wine cellar.\n• The ancient remains were found in Mexico.\n• No further details about the discovery have been released.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Netherlands",
        "summary": "• The International Court of Justice at The Hague has ordered Israel to halt its military operation in the Gaza Strip.\n• The ruling comes after Egypt withdrew its forces from the area, allowing Israeli troops to advance further into the territory.\n• The ICJ's decision is seen as a significant blow to Israel's efforts to maintain control over the region.",
        "coordinates": [
            52.2434979,
            5.6343227
        ]
    },
    {
        "location": "Niger",
        "summary": "• A military coup occurred in Niger.\n• Security forces have taken control of key government buildings.\n• The current whereabouts of President Mahamadou Issoufou remain unknown.",
        "coordinates": [
            17.7356214,
            9.3238432
        ]
    },
    {
        "location": "Papua New Guinea",
        "summary": "• A devastating landslide has struck Papua New Guinea, trapping numerous villagers.\n• Emergency responders are racing against time to reach the affected areas and rescue those in need.\n• The situation remains critical as search and rescue efforts continue to unfold.",
        "coordinates": [
            -5.6816069,
            144.2489081
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Cynthia, who voted for Nelson Mandela, is now abandoning his successors.\n• She had previously supported Mandela but has since changed her stance.\n• This shift in opinion may be due to various reasons such as political ideology or personal beliefs.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Spain",
        "summary": "• Four people died in a building collapse in Majorca.\n• Locals protested against a Louis Vuitton fashion show in Barcelona.\n• The event caused chaos.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Sudan",
        "summary": "• A United Nations expert warns that the world is ignoring the risk of genocide in Sudan.\n• The situation remains volatile due to ongoing political instability, conflict, and human rights abuses.\n• The international community must take immediate action to prevent a potential humanitarian crisis.",
        "coordinates": [
            10.9,
            6.5
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Rishi Sunak and Keir Starmer are the top contenders for UK Prime Minister.\n• Both candidates have unique strengths and weaknesses that will be crucial in their bid for leadership.\n• Their political views and leadership styles will shape the future direction of the country.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Alec Baldwin's request to dismiss Rust manslaughter charges is rejected.\n• Families of the Uvalde shooting sue Meta, a video game developer, and a firearms manufacturer.\n• A teenager is arrested after a violent incident at a UCLA Gaza protest.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]