[
    {
        "location": "Canada",
        "summary": "• Half of historic Canadian town potentially destroyed by wildfires\n• Wildfires rage across 170+ areas in Alberta, including Jasper resort town\n• Residents lose homes to devastating fires",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• Typhoon Gaemi hit China causing damage and flooding.\n• The typhoon also caused death tolls in Taiwan and the Philippines before reaching China.\n• People were rescued amidst the floodwaters, with videos showing people being saved from flooded shops and streets.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Ethiopia",
        "summary": "• Satellite images and doctor testimonies confirm a severe hunger crisis in Ethiopia.\n• The crisis is exacerbated by conflict in Tigray region.\n• The situation requires urgent attention to prevent further suffering.",
        "coordinates": [
            10.2116702,
            38.6521203
        ]
    },
    {
        "location": "France",
        "summary": "• Paris will host the Olympics for the first time since 1924.\n• The decision to award the 2024 Olympics to Paris was influenced by the city's successful bid.\n• The 2024 Olympics may be overshadowed by the 1972 Munich Olympics, which were marred by tragedy when Israeli athletes were killed during an attack on their Olympic Village.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "India",
        "summary": "• The decline of Indian vultures has resulted in approximately 500,000 human deaths.\n• This is due to their role as scavengers, which helps clean up carcasses and prevent the spread of diseases.\n• As a result, their disappearance has contributed significantly to the number of human fatalities.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Indonesia",
        "summary": "• Scientists discover Komodo dragons have iron-coated teeth\n• Iron coating allows for easier ripping of prey",
        "coordinates": [
            -2.4833826,
            117.8902853
        ]
    },
    {
        "location": "Israel",
        "summary": "• The Israeli military has recovered the bodies of five hostages from Gaza.\n• Israel recovers the bodies of five hostages amid delays in negotiations over a potential peace deal.\n• Despite criticism, Prime Minister Netanyahu continues to defend his efforts in the Gaza conflict and maintains his stance against Hamas.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "New Zealand",
        "summary": "• An American reality show contestant has been accused of killing and eating a protected bird species in New Zealand.\n• The incident has sparked outrage among conservationists and wildlife experts.\n• The authorities have launched an investigation into the matter to determine whether any laws were breached.",
        "coordinates": [
            -41.5000831,
            172.8344077
        ]
    },
    {
        "location": "Pakistan",
        "summary": "• A Pakistani artist created a Ghibli-style animation inspired by traditional Pakistani art.\n• The artwork featured intricate designs and vibrant colors characteristic of Japanese anime.\n• This style was new to Pakistan but gained popularity among locals who appreciated its unique beauty.",
        "coordinates": [
            30.3308401,
            71.247499
        ]
    },
    {
        "location": "Papua New Guinea",
        "summary": "• A gang killed women and children in Papua New Guinea\n• The incident is being reported as a massacre\n• Details about the attack are still emerging",
        "coordinates": [
            -5.6816069,
            144.2489081
        ]
    },
    {
        "location": "South Korea",
        "summary": "• North Korea sent balloons to drop trash on the South Korean presidential office\n• The incident caused disruption at the Blue House\n• South Korea is seeking clarification from North Korea about the incident",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Syria",
        "summary": "• International sanctions have devastated Syria's economy.\n• In response, the country has turned to illegal activities such as drug production to survive.\n• As a result, Syria is now facing severe economic challenges due to its reliance on illicit industries.",
        "coordinates": [
            34.815353599999995,
            38.42307447267531
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• A teenager has been detained in connection with the murder of a Ukrainian nationalist former MP.\n• The conflict in Ukraine is transforming the nature of war due to the increased use of drones.\n• After years of anticipation, Ukraine is finally receiving its first deliveries of F-16 fighter jets, which will bolster its military capabilities.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• A new UK state company is developing offshore wind farms on seabeds owned by Prince Charles.\n• Divers have discovered a 19th-century shipwreck carrying 100 champagne bottles.\n• The British royal family will receive a significant salary increase due to the Crown Estate's record-breaking £1.4 billion profit.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• The leader of Mexico's Sinaloa drug cartel has been arrested in Texas.\n• Netanyahu met with Biden to discuss closing \"gaps\" in the Gaza ceasefire deal.\n• A vehicle drove through an intense wildfire in California.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Venezuela",
        "summary": "• Ordinary Venezuelans risk their lives to safeguard election integrity.\n• They face threats from both government and opposition forces.\n• Their bravery may lead to political change in Venezuela.",
        "coordinates": [
            8.0018709,
            -66.1109318
        ]
    },
    {
        "location": "Yemen",
        "summary": "• A boat carrying 45 migrants and refugees has capsized off the coast of Yemen.\n• The incident resulted in multiple fatalities among the passengers on board.\n• The survivors were rescued by local fishermen and taken to safety.",
        "coordinates": [
            16.3471243,
            47.8915271
        ]
    }
]