[
    {
        "location": "Argentina",
        "summary": "• Clashes erupted in Buenos Aires over proposed economic reforms\n• Protesters clashed with police in response to the government's plans\n• The demonstrations highlighted divisions within Argentine society",
        "coordinates": [
            -34.9964963,
            -64.9672817
        ]
    },
    {
        "location": "Australia",
        "summary": "• Stranded surfer rescued after spelling out 'HELP' \n• Holly Valance: From Aussie pop star to Trump cheerleader",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Denmark",
        "summary": "• The Danish Prime Minister feels like they're not themselves after an attack.\n• They admit to feeling different since the incident.\n• This admission may impact their ability to lead effectively.",
        "coordinates": [
            55.670249,
            10.3333283
        ]
    },
    {
        "location": "France",
        "summary": "• The far-right has lost its leader due to disagreements with their alliance.\n• President Macron claims snap elections show he trusts in democracy.\n• Macron criticizes potential alliances between right-wing parties.\n• Jordan Bardella, aged 28, represents the French far-right movement.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• Germany considers reinstating mandatory military service amid rising global tensions.\n• Reintroduction aims to boost military capabilities in response to European security concerns.\n• Potential move seen as crucial step towards strengthening Germany's defense posture in the face of escalating regional conflicts.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel denies responsibility for civilian casualties in Gaza\n• Hamas claims Israeli airstrikes killed civilians in Gaza\n• Tensions remain high between Israel and Palestine",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• The G7 summit is coming to Italy.\n• The event will feature seven new ice cream flavors.\n• The Pope will also attend the summit.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Hezbollah launches rocket attacks on Israel in retaliation for killing of senior commander.\n• US blames Hamas for prolonging the conflict in Gaza.\n• Tensions escalate between Lebanon, Israel, and Palestine over recent violence.",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• The military has maintained its professional detachment from politics since 1999.\n• A stable government with President Muhammadu Buhari has reduced political instability.\n• Democratic institutions have strengthened, making coups less likely.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "South Korea",
        "summary": "• The first member of K-pop group BTS has completed their military service.\n• They have expressed gratitude to fans by promising 1,000 hugs upon release from duty.\n• This marks a milestone in the band's career as they transition back to music after military commitments.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Spain",
        "summary": "• A bull escaped from a rodeo in Spain.\n• The loose bull threw a bystander into the air.\n• No serious injuries were reported.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Thailand",
        "summary": "• A heartwarming Thai film is trending on TikTok\n• It's leaving viewers emotional and tearful\n• Its popularity continues to grow",
        "coordinates": [
            7.4931858,
            124.724704
        ]
    },
    {
        "location": "USA",
        "summary": "• The Gaza ceasefire plan is in jeopardy after US claims Hamas has proposed changes.\n• The US expands its banking sanctions against Russia amid ongoing tensions.\n• A judge dismisses the lawsuit filed by survivors of the Tulsa Massacre.\n• The US government considers commuting Hunter Biden's prison sentence.\n• US President Biden introduces stricter border control measures, sparking controversy.\n• The country sends additional military aid to Ukraine.\n• A global survey reveals Joe Biden enjoys higher popularity ratings than Donald Trump.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• A Russian missile attack killed 9 people in Ukrainian President Volodymyr Zelensky's hometown.\n• The US is supplying Ukraine with advanced military equipment, including drones and artillery systems.\n• Ukraine is using American weapons to counter Russian aggression in eastern regions.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "Yemen",
        "summary": "• Houthis claim responsibility for attacking a merchant ship in the Red Sea.\n• The incident has raised concerns about maritime security in the region.\n• The conflict between the Houthi rebels and Saudi-led coalition continues to escalate.",
        "coordinates": [
            16.3471243,
            47.8915271
        ]
    }
]