[
    {
        "location": "Afghanistan",
        "summary": "• Cricket brings happiness to Afghans.\n• Climate change threatens the Taliban's shift away from opium.\n• This could have a global impact.",
        "coordinates": [
            33.7680065,
            66.2385139
        ]
    },
    {
        "location": "Australia",
        "summary": "• Hundreds of naked swimmers gather at Sydney's Bondi Beach\n• They participate in the annual Winter Solstice Swim event\n• The event marks the shortest day of the year in Australia",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Belarus",
        "summary": "• Belarus opposition leader warns Poland over border tensions\n• Tensions rise between Belarus and Poland due to border dispute\n• Belarus opposition leader urges calm in face of escalating conflict",
        "coordinates": [
            53.4250605,
            27.6971358
        ]
    },
    {
        "location": "Canada",
        "summary": "• Edmonton Oilers make a historic comeback in ice hockey\n• The team turned things around to thrill their fans\n• A remarkable win for the Edmonton Oilers in ice hockey history",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• China and EU will discuss electric car tariffs.\n• China uses axes and knives during territorial disputes.\n• China previously supported wealthy criminal families.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "France",
        "summary": "• A woman was attacked by wolves at a safari park near Paris.\n• Celebrities attended a Vogue fashion event in Paris.\n• The upcoming French presidential election is causing uncertainty in financial markets due to concerns about national debt.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "India",
        "summary": "• Exam scandals undermine the credibility of India's education system.\n• The impact on young Indians' futures is severe due to lost opportunities and mistrust.\n• Reforms are urgently needed to prevent further damage and restore faith in the system.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• Iran's supreme court has overturned the death sentence of an anti-regime rapper.\n• The decision comes after multiple appeals by the musician's supporters.\n• The move is seen as a significant blow to the Iranian regime's hardline stance on dissent.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israeli soldiers tied up an injured Palestinian to a jeep.\n• Defense Chief visits DC amid rising Hezbollah threats.\n• Netanyahu faces numerous conflicts in his career.\n• Netanyahu fights with nearly all groups.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "North Korea",
        "summary": "• Russian President Vladimir Putin visited North Korea\n• He was greeted with grandeur, gifts, and performances \n• The visit highlights diplomatic efforts between Russia and North Korea",
        "coordinates": [
            40.3736611,
            127.0870417
        ]
    },
    {
        "location": "Saudi Arabia",
        "summary": "• At least 1,301 people died during Hajj in Saudi Arabia.\n• Huge Saudi construction projects may be scaled back due to funding issues.\n• Climate change poses a significant threat to vulnerable populations during hot weather events like Hajj.",
        "coordinates": [
            25.6242618,
            42.3528328
        ]
    },
    {
        "location": "South Korea",
        "summary": "* K-pop band Seventeen is set to perform at a UK festival\n* They will become one of the first K-pop groups to headline a major international event in Europe\n* Their performance is expected to attract attention from new fans and showcase their global appeal",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Ukraine claims to have destroyed a Russian drone base.\n• The incident occurred during ongoing hostilities between Ukraine and Russia.\n• The strike may have had significant military implications for both sides.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Taylor Swift's popularity reaches new heights in the UK.\n• Her music is now a favorite among both ordinary citizens and the royal family.\n• The singer-songwriter has brought people together across different social classes through her music.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Trump and Biden prepare for their debate.\n• Heavy rain causes floods in the US Midwest.\n• A missing hiker survived by drinking a gallon of water daily.\n• The first Biden-Trump debate will be held on September 29th.\n• An Israeli-Palestine expert resigned due to the Gaza crisis.\n• US restrictions put Russian airbases outside of firing range.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Yemen",
        "summary": "• A man's Rolex watch was found after being lost in a cow's stomach 50 years ago.\n• Despite US efforts to stop them, Yemen's Houthi rebels continue to attack ships in the Red Sea.",
        "coordinates": [
            16.3471243,
            47.8915271
        ]
    }
]