[
    {
        "location": "Bangladesh",
        "summary": "• At least 90 people have been killed in anti-government protests in Bangladesh.\n• The protests resumed after a brief calm following previous violent demonstrations against the government.\n• Many of those killed were reportedly shot by security forces attempting to disperse the crowds.",
        "coordinates": [
            -0.2864982,
            36.0514231
        ]
    },
    {
        "location": "Belgium",
        "summary": "• The Belgian team is disqualified from the triathlon relay event.\n• An illness has been reported in one of their athletes.",
        "coordinates": [
            50.6402809,
            4.6667145
        ]
    },
    {
        "location": "France",
        "summary": "• France's cycling team is excelling at the World Championships, with a strong record and fine margins in key events.\n• \"Marchand-mania\" has united the nation behind the successes of cyclist Christophe Marchand. \n• The success may not be sustained as it requires consistency to maintain momentum and achieve long-term goals.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Iran",
        "summary": "• Iran denies direct involvement in the killing of Hamas leader Ahmed Abu Ali.\n• Tehran says the murder was likely a plot orchestrated by Arab regimes to undermine Palestinian unity.\n• Iran accuses Saudi Arabia and other Gulf states of supporting anti-Iranian Israeli operations.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Casualties reported after three Israeli strikes on schools in a week.\n• Tensions escalate as strikes and stabbings occur in Gaza and near Tel Aviv.\n• Israel prepares for potential wider conflict amid fears of escalation.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Authorities urge foreign nationals to depart Lebanon amid escalating tensions\n• Tensions between government and opposition groups rise, fueling concerns of a civil war\n• Residents are bracing themselves for potential conflict as the situation in the country worsens",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• Nigerian President Muhammadu Buhari has called on citizens to put an end to deadly protests.\n• The demonstrations were sparked by widespread discontent over fuel subsidies, which have been removed as a result of government policies.\n• The protests turned violent in multiple locations across the country.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "North Korea",
        "summary": "• North Korea's participation at the PyeongChang Olympics sparks diplomatic relations with South Korea\n• The move is seen as a strategic step to ease tensions and pursue peace talks\n• It comes after years of escalating rhetoric between the two countries under Kim Jong-un's rule",
        "coordinates": [
            40.3736611,
            127.0870417
        ]
    },
    {
        "location": "Pakistan",
        "summary": "• Ex-Pakistan PM Imran Khan marks one-year anniversary of detention.\n• His party remains the largest opposition group despite his imprisonment.",
        "coordinates": [
            30.3308401,
            71.247499
        ]
    },
    {
        "location": "Spain",
        "summary": "• A supercell tornado swept through El Toro, Spain.\n• The storm caused significant damage to properties and structures.\n• Details on injuries or fatalities are not available.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Taiwan",
        "summary": "• The Taiwanese government has been conducting civil defense drills to prepare citizens for a potential Chinese military invasion.\n• However, many citizens are reportedly feeling anxious and uncertain about the possibility of war, with some expressing doubts about their preparedness.\n• Critics argue that the government's efforts may not be effective in boosting public morale or readiness, with concerns that panic could spread if tensions escalate.",
        "coordinates": [
            23.5983227,
            120.83537694479215
        ]
    },
    {
        "location": "US",
        "summary": "• US military assets being redeployed to Middle East amid tensions with Iran.\n• Increased concerns about potential Iranian attacks on American allies, including Israel.\n• US forces moving into position in support of Israeli security as threats from Tehran escalate.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• The US has delivered the first batch of F-16 fighter jets to Ukraine.\n• This marks a significant upgrade in Ukraine's military capabilities.\n• The delivery comes after a prisoner swap between Ukraine, Russia, and the US showed diplomacy can happen between Moscow and the West.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United States",
        "summary": "• Kamala Harris is conducting interviews for potential VP candidates.\n• A cat was saved by police after a jar got stuck on its head.\n• A toddler was rescued after falling down a 10-foot pipe.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Venezuela",
        "summary": "• Venezuelan president Nicolás Maduro's re-election bid failed.\n• Preliminary vote counts indicate he did not secure a majority.\n• The outcome was condemned by various international parties, both left-wing and right-wing.",
        "coordinates": [
            8.0018709,
            -66.1109318
        ]
    },
    {
        "location": "Zambia",
        "summary": "• Popular gospel singer has passed away.\n• Singer was well-known among church and club goers in Zambia.\n• The country is mourning the loss of this music talent.",
        "coordinates": [
            -14.5189121,
            27.5589884
        ]
    }
]