[
    {
        "location": "Afghanistan",
        "summary": "• The Taliban restricts opportunities for Afghan women, forcing them to live secret lives.\n• Many Afghan women turn to the internet to maintain some autonomy and freedom.\n• Online platforms provide a space for Afghan women to connect with others who share similar experiences and challenges.",
        "coordinates": [
            33.7680065,
            66.2385139
        ]
    },
    {
        "location": "France",
        "summary": "• Projections show that France's left alliance has taken a surprise lead.\n• The French have rejected the far-right again.\n• There was jubilation and stunned silence as the results were announced.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Hungary",
        "summary": "• Viktor Orban visits Moscow\n• Angers EU allies\n• Hungry leader visits Russia",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "India",
        "summary": "• In rural areas, women accused of witchcraft face murder and violence from their own families over disputes about land ownership.\n• Fetching water for household chores is a significant obstacle to education and economic opportunities for Indian women, particularly in rural areas where access to clean drinking water is limited.\n• The lack of access to basic amenities like clean water hinders girls' ability to attend school regularly, perpetuating cycles of poverty and inequality.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• Iranian reformist wins presidency, seeking engagement with the West.\n• Low voter turnout may indicate discontent among voters or apathy towards politics in Iran.\n• The election process is overseen by the Guardian Council, ensuring candidates meet strict criteria before being approved.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israeli-Hamas talks resume, then adjourn again amid muted optimism\n• Resumption of talks follows recent tensions between Israel and Hamas in Gaza Strip\n• Uncertainty surrounds future prospects for agreement or truce between both sides",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Japan",
        "summary": "• Tokyo's first female governor is expected to win her third term after surviving the COVID-19 pandemic and the Olympics.\n• Despite winning its \"war\" against floppy disks, Japan still has an affinity for outdated technology.\n• Japan has made progress in modernizing its technology infrastructure despite lingering support for older devices.",
        "coordinates": [
            36.5748441,
            139.2394179
        ]
    },
    {
        "location": "Spain",
        "summary": "• Protests against mass tourism in Barcelona\n• Demonstrators used water to disrupt tourist activities\n• Calls for responsible travel practices in popular destinations",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Sweden",
        "summary": "• The woman accused Assange of sexual assault.\n• However, she is relieved that he has been released from detention.\n• Her accusations were likely due to her belief in the seriousness of the charges against him.",
        "coordinates": [
            59.6749712,
            14.5208584
        ]
    },
    {
        "location": "Switzerland",
        "summary": "• WTO Chief Warns Against Global Trade Breakdown\n• Warning Issued Over Global Economic Disruption Risks \n• Economic Dangers Highlighted By International Organization Head",
        "coordinates": [
            46.7985624,
            8.2319736
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• New UK Prime Minister Keir Starmer meets the King and gives a speech.\n• He gets to work with his newly formed government.\n• The 14-year conservative government has significantly impacted British society.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Western US faces severe heatwaves.\n• A young NFL player dies in a car accident.\n• A famous movie producer passes away at 63.\n• Wrestler John Cena retires from his sport.\n• Many Americans struggle with debt just to buy food.\n• The Democratic party considers the consequences of losing Joe Biden as their candidate.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]