[
    {
        "location": "Bolivia",
        "summary": "• A group attempted to stage a coup in Bolivia.\n• The attempt was unsuccessful within just 75 seconds.\n• This highlights the resilience of the country's government and institutions during times of political unrest.",
        "coordinates": [
            -17.0568696,
            -64.9912286
        ]
    },
    {
        "location": "Brazil",
        "summary": "• A plane was diverted to Brazil due to severe turbulence that injured 30 people on board.\n• The incident highlights concerns about air travel safety in turbulent weather conditions.\n• An investigation is underway to determine the cause of the turbulence and ensure passenger safety in future flights.",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "Egypt",
        "summary": "• An Egyptian airline has apologized for leaving passengers in wheelchairs on the tarmac.\n• The incident occurred when an airplane departed without the passengers being properly seated.\n• The apology acknowledges the inconvenience caused to those affected.",
        "coordinates": [
            26.2540493,
            29.2675469
        ]
    },
    {
        "location": "France",
        "summary": "• French political parties have launched a new campaign after the success of far-right candidates.\n• Far-right candidate Jordan Bardella has become the face of the movement at just 28 years old.\n• Voters are turning against President Macron's centrist policies, giving a boost to far-right candidates.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Greece",
        "summary": "• A millionaire faces allegations regarding the Greek fires\n• The individual claims to be surprised by these accusations\n• Further details about the incident remain unclear",
        "coordinates": [
            39.0742,
            21.8243
        ]
    },
    {
        "location": "Hungary",
        "summary": "• Hungary is pushing against European Union norms with its \"Make Europe Great Again\" slogan.\n• The country's hard-right stance contradicts EU values.\n• This move puts Hungary at odds with its European partners.",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "India",
        "summary": "• Medical Council of India to conduct NEET PG 2022 exam\n• Students protest against the exam pattern\n• Exam results will determine the future of aspiring Indian doctors",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• In Egypt, Gaza evacuees live in the shadows.\n• Iran has extended voting hours in its presidential elections.\n• Everything is closing in on Gaza evacuees.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Ireland",
        "summary": "• The Director of Public Prosecutions has lodged an appeal against the leniency of the sentence handed down to an Irish soldier who assaulted another soldier\n• This move comes after concerns were raised about the fairness of the initial sentence, which was deemed too light by many observers\n• The appeal aims to ensure that justice is served in this high-profile case, sparking widespread interest among the public",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel orders Palestinians to leave southern Gaza area after rocket fire.\n• Israel releases head of Gaza's al-Shifa hospital after seven months.\n• Gaza's remaining hospitals will stop working in two days, health officials warn.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• The ongoing conflict between Lebanon and Israel has created an atmosphere of unease among citizens.\n• Tensions remain high due to unresolved border disputes and military posturing.\n• Escalation risks further destabilizing the region.",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Malawi",
        "summary": "• Malawi's music industry has lost one of its most influential figures\n• The musician dedicated his life to uplifting the lives of the marginalized through music\n• His passing leaves a significant gap in Malawi's cultural landscape",
        "coordinates": [
            -13.2687204,
            33.9301963
        ]
    },
    {
        "location": "North Korea",
        "summary": "• A North Korean family fled their country by hijacking a small fishing boat.\n• The escapees were forced to navigate treacherous waters without proper equipment or supplies.\n• After days at sea, they finally reached safety and shared their harrowing tale with the world.",
        "coordinates": [
            40.3736611,
            127.0870417
        ]
    },
    {
        "location": "South Africa",
        "summary": "• ANC loses majority but remains largest party\n• Opposition parties gain seats amid dissatisfaction with ANC rule\n• New government formed through coalition deal between ANC and opposition parties",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "South Korea",
        "summary": "• At least 9 people were killed\n• A car plowed into a crowd\n• Incident occurred in Seoul",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Taiwan",
        "summary": "• Taiwan is concerned about China's potential military aggression due to similarities with Russia's actions in Ukraine.\n• Taiwan is increasing its defense capabilities through arms purchases and training exercises.\n• Taiwan has strengthened diplomatic ties with countries that support its sovereignty amid rising tensions with China.",
        "coordinates": [
            23.5983227,
            120.83537694479215
        ]
    },
    {
        "location": "United States",
        "summary": "• Biden criticizes Trump for undermining the rule of law\n• Biden's family supports his decision to continue in the White House race\n• A judge releases Epstein transcripts unexpectedly\n• A mistrial is declared for an American woman accused of murdering her boyfriend \n• The U.S. suspends aid to Gaza amid ongoing conflict\n• Iran prepares for a presidential runoff election between a reformer and a conservative\n• The U.S. seeks a peace agreement with Lebanon to prevent war",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Venezuela",
        "summary": "• Founder of Venezuela's most feared gang arrested",
        "coordinates": [
            8.0018709,
            -66.1109318
        ]
    }
]