[
    {
        "location": "Brazil",
        "summary": "• Uncontacted tribe faces threat from loggers.\n• Government fails to take action to protect the tribe.\n• Tribe's existence is at risk due to logging activities.",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "China",
        "summary": "• China seeks to strengthen its relations with other countries in Asia to counterbalance the growing alliance between Japan and South Korea and the United States.\n• China is exploring options to improve economic cooperation and deepen strategic partnerships with Southeast Asian nations like Indonesia, Malaysia, and Singapore.\n• The move aims to reduce China's dependence on trade with the US and boost regional stability through multilateral agreements and joint infrastructure projects.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Egypt",
        "summary": "• An Egyptian soldier was killed during an incident at the Israeli-Egyptian border.\n• The cause of the incident is unclear.\n• There have been no reports on casualties or damage from other parties involved.",
        "coordinates": [
            26.2540493,
            29.2675469
        ]
    },
    {
        "location": "France",
        "summary": "• A fortune teller in France was found to have defrauded clients out of millions of euros.\n• The scam was uncovered by authorities investigating money laundering allegations.\n• Many victims have come forward to report their losses, leading to widespread outrage.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "India",
        "summary": "1. A hospital in Delhi faced criticism after it was found to be operating without a valid license, which may have contributed to the deaths of several babies.\n2. An investigation is underway into an incident involving a devastating fire that broke out at an arcade in India, resulting in fatalities.\n3. Despite increased social acceptance of LGBTQ individuals, political policies and laws remain outdated and discriminatory towards this community.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Israel",
        "summary": "• Prime Minister Netanyahu calls deadly strike on Rafah a \"tragic mishap\".\n• The strike resulted in dozens of deaths.\n• Israel's actions spark international criticism, with the UN calling for compliance with an ICJ order to stop the assault.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Kenyan leader suggests private jets as a cost-effective alternative.\n• Rising housing costs in Kenya make homeownership unaffordable for many.\n• Ex-convicts with illegal firearms instill fear among Kenyan law enforcement officials.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Mexico",
        "summary": "• A kidnapped Mexican politician, who was running for mayor, has been found alive.\n• Claudia Sheinbaum Pardo is expected to become Mexico's first female president if elected.\n• There are no other significant updates related to Mexico mentioned in the provided news headlines.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Papua New Guinea",
        "summary": "• Thousands feared buried by landslide in Papua New Guinea.\n• Landslide kills an estimated 670 people in Papua New Guinea.\n• Authorities struggle to locate victims due to remote location and rugged terrain.",
        "coordinates": [
            -5.6816069,
            144.2489081
        ]
    },
    {
        "location": "Qatar",
        "summary": "• 12 passengers were injured during a severe bout of turbulence on a Qatar Airways flight.\n• The incident occurred while the plane was flying over international waters.\n• All passengers have since been safely disembarked from the aircraft.",
        "coordinates": [
            25.3336984,
            51.2295295
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Political tensions escalate in South Africa ahead of upcoming elections\n• Multiple political killings reported in recent weeks\n• Concerns over safety and stability during election period",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Spain",
        "summary": "• A newly verified Caravaggio painting is being exhibited in Madrid.\n• The artwork has been authenticated by experts after years of study and research.\n• This rare opportunity allows art enthusiasts to see the masterpiece up close in its new location.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "USA",
        "summary": "• Deadly tornadoes prompt millions of Americans to seek shelter or evacuate due to severe weather alerts.\n• US President honors fallen service members during Memorial Day events; also reaffirms commitment to protecting American democracy abroad.\n• Several notable figures pass away, including a veteran flight attendant, an NBA legend, and a renowned basketball commentator.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Ukrainian President Zelensky urges the West to force Russia to make peace.\n• The West is being urged to take action against Russia by Ukrainian President Volodymyr Zelensky to end the ongoing conflict between the two nations.\n• Ukrainian musicians have now turned into fighters during the conflict.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    }
]