[
    {
        "location": "China",
        "summary": "• Reports emerge of fuel tankers carrying cooking oil\n• Public outraged over misuse of resources\n• Authorities investigate to ensure compliance with regulations",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "France",
        "summary": "• Three French rugby players charged with rape in Argentina\n• Incident occurred during recent international match between France and Argentina\n• Players face potential legal consequences and possible expulsion from national team",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• Germany expresses shock over alleged Russian assassination plot\n• German government reacts to potential threat from Russia\n• Country's security concerns heightened by possible threat",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Haiti",
        "summary": "• Kenyan police start patrols in Haiti.\n• Haitian gangs remain unaffected by the increased security presence.\n• Gangs continue to operate undeterred in Haiti despite the new patrols.",
        "coordinates": [
            19.1399952,
            -72.3570972
        ]
    },
    {
        "location": "Hungary",
        "summary": "• Viktor Orban claims to be a peacekeeper but lacks a clear strategy.\n• He is expanding his international influence despite lacking a concrete plan.\n• His actions have raised concerns about his ability to effectively promote peace.",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "India",
        "summary": "• Ambani's son gets married to his fiancée.\n• Celebrities like former PMs, film and sports stars attend the ceremony.\n• Kim Kardashian, Justin Bieber, and Rihanna also attend the grand India wedding.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Ukrainian President holds talks with Irish PM\n• Talks expected to address Ukraine-Russia conflict\n• Stronger bilateral ties discussed between leaders",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• A freed Israeli hostage recalls feeling joyful upon rescue from captivity.\n• The individual also experienced depression during their time in captivity.\n• On October 7th, the Israeli military claimed that they failed to adequately protect a Gaza border town.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Kenya",
        "summary": "• The police chief resigned due to violent anti-tax protests.\n• Protests led to President sacking disliked ministers.\n• Kenya's government faces turmoil amidst unrest.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Death and rubble fill streets of Tal Al-Sultan.\n• Rescuers face danger from Israeli fire.\n• Death and rubble fill streets of Tal Al-Sultan.",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Mexico",
        "summary": "• Mexico's new president has experience in environmental issues\n• She aims to address the country's dependence on oil exports\n• Her leadership may impact Mexico's energy sector and economy",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• A school collapsed in Nigeria.\n• The incident resulted in children being killed.\n• The tragedy highlights concerns over building safety standards in the country.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "Poland",
        "summary": "• Poland is considering shooting down Russian missiles that may enter its airspace from Ukraine.\n• The move comes amid escalating tensions between Russia and Ukraine.\n• Polish authorities are working to ensure national security in light of these developments.",
        "coordinates": [
            52.215933,
            19.134422
        ]
    },
    {
        "location": "South Korea",
        "summary": "• The Trader Joe's seasoning has been banned in South Korea due to its popularity.\n• This ban is part of South Korea's efforts to control the importation of certain products.\n• South Korean authorities have deemed this product a threat to public health or safety.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Buckingham Palace's East Wing, including its famous balcony, is now open to the public.\n• The UK government has pledged to prioritize supporting Ukraine in its conflict against Russia.\n• The British monarch's official residence will welcome visitors from all over the world.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Alec Baldwin's Rust trial has been dismissed due to hidden evidence.\n• The US is facing an issue where hackers have stolen nearly all AT&T customer call records.\n• President Biden had a poor performance when answering questions from reporters, including two instances of stumbling through his responses.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]