[
    {
        "location": "Canada",
        "summary": "• Abuse revelations prompt professors to re-examine their teaching methods\n• Professors struggle to find effective ways to teach Alice Munro's works in light of recent abuse allegations\n• Educators seek alternative approaches to ensure students can engage with Munro's writing without perpetuating harm",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• Reports have emerged that fuel tankers in China may be used to transport cooking oil.\n• This practice has sparked outrage among Chinese citizens who see it as an improper use of resources.\n• The transportation of food products by fuel tankers raises concerns about efficiency, safety, and environmental impact.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Colombia",
        "summary": "• Liverpool player Darwin Núñez argued with Colombian fans\n• The incident occurred at Estadio Olímpico Poblado in Medellín\n• No further details were released about the altercation",
        "coordinates": [
            4.099917,
            -72.9088133
        ]
    },
    {
        "location": "France",
        "summary": "• Three French rugby players have been charged with rape in Argentina.\n• Lamine Yamal is being pursued by three countries for his soccer skills.\n• A woman was allegedly raped by French rugby players in Argentina.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• A potential assassination plot against a high-ranking German official has been uncovered.\n• The alleged conspiracy is attributed to Russia.\n• German authorities have expressed shock and concern over this revelation.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Haiti",
        "summary": "• Kenyan police start patrolling\n• Haitian gangs remain unbothered by their presence",
        "coordinates": [
            19.1399952,
            -72.3570972
        ]
    },
    {
        "location": "Hungary",
        "summary": "• Hungarian Prime Minister Viktor Orban is positioning himself as a global peacemaker despite lacking a clear strategy.\n• His efforts to resolve international conflicts are seen as ambiguous and lacking direction.\n• Critics argue that his approach is ineffective in addressing regional tensions and disputes.",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "India",
        "summary": "• Extravagant wedding of India tycoon Ambani's son begins.\n• A-list celebrities attend the lavish event.\n• International stars like Kim Kardashian, Justin Bieber, and Rihanna arrive to celebrate.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israeli military fails to protect Gaza border town on October 7\n• Israeli hostage freed from captivity after joyful rescue, experienced depression during captivity\n• Israeli military fails to protect Gaza border town on October 7",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Kenya",
        "summary": "• Kenya's police chief resigns amid violent protests against taxes.\n• President fires unpopular cabinet members amid ongoing unrest.\n• Protesters continue to demand action on tax policies.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Mexico",
        "summary": "• Mexico's newly appointed leader has a background in climate science.\n• The country relies heavily on its oil industry.\n• This leader may be able to address environmental concerns while maintaining energy production.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• A tragic incident occurred at a Nigerian school where children lost their lives due to a building collapse.\n• The exact number of fatalities is unknown, but it is confirmed that several young lives were taken.\n• The cause of the collapse remains under investigation by authorities.",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "Poland",
        "summary": "• Poland considers shooting down Russian missiles\n• This move is in response to Russia's actions in Ukraine\n• The country wants to protect its citizens from potential threats",
        "coordinates": [
            52.215933,
            19.134422
        ]
    },
    {
        "location": "South Korea",
        "summary": "• The Trader Joe's seasoning is popular in South Korea.\n• It is banned by law in South Korea.\n• There are concerns about its safety or quality.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Ukrainian President will hold talks with Irish Prime Minister.\n• \n• \n•",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Buckingham Palace's East Wing opens to the public.\n• The UK's new government prioritizes fighting in Ukraine.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Alec Baldwin’s Rust trial was dismissed due to hidden evidence.\n• The US has been hacked, resulting in stolen call records from nearly every AT&T customer.\n• Democratic politicians are supporting Biden despite his recent mistakes.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Zimbabwe",
        "summary": "• Massacre survivors struggle to come to terms with their experiences.\n• Survivors feel betrayed by the government's inaction during the massacre.\n• The incident has left deep emotional scars on those affected.",
        "coordinates": [
            -18.4554963,
            29.7468414
        ]
    }
]