[
    {
        "location": "Canada",
        "summary": "• Scooter Braun retires from music management after 23 years.\n• Researchers discover the ship where Ernest Shackleton died in Canada.\n• A famous musician's manager has retired after 23 years. \n• Canadian researchers have found a historic ship that was involved in an important event.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• China is reportedly planning to significantly expand its nuclear arsenal.\n• This move comes amid rising tensions with other nations in the region.\n• The expansion could lead to increased instability in the Asia-Pacific area.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Cuba",
        "summary": "• Russia sends warships to Cuba amid growing tensions with US\n• Ships arrive in Havana as part of joint naval exercise between countries\n• Presence seen as challenge to US dominance in Caribbean region",
        "coordinates": [
            23.0131338,
            -80.8328748
        ]
    },
    {
        "location": "Ecuador",
        "summary": "• Torrential rains cause widespread destruction and loss of life due to deadly landslides in Ecuador\n• Heavy rainfall leads to devastating consequences across the country\n• Authorities work tirelessly to rescue those trapped under debris and provide aid to affected communities",
        "coordinates": [
            -1.3397668,
            -79.3666965
        ]
    },
    {
        "location": "France",
        "summary": "• Kylian Mbappé urges young people to vote against extremists.\n• Jordan Bardella may become Prime Minister of France at 28 years old.\n• The city of Paris rehearsed its Olympic opening ceremony in preparation for the games.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• A man was shot by police while carrying an axe in Hamburg.\n• The incident sparked alarm among residents, raising concerns about public safety.\n• Police responded promptly to neutralize the threat, but details of the motive remain unclear.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Greece",
        "summary": "• The Greek opposition demands an investigation into reports of migrant deaths, citing concerns over humanitarian treatment.\n• They urge action to prevent similar incidents in the future.\n• The opposition's call comes amid growing scrutiny of Greece's handling of migration policies.",
        "coordinates": [
            39.0742,
            21.8243
        ]
    },
    {
        "location": "India",
        "summary": "• India's Booker Prize-winning author may be jailed for an offensive remark made in 2008.\n• The author faces up to two years in prison under the National Security Act.\n• Prime Minister Narendra Modi is facing criticism over his handling of the COVID-19 crisis.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iraq",
        "summary": "• Iraqi militias protest against US involvement in Gaza conflict by targeting American businesses\n• Militias attack KFC and other US companies to express their discontent with US role in Gaza conflict\n• Protests escalate as militia groups target US-owned businesses in response to Gaza situation",
        "coordinates": [
            33.0955793,
            44.1749775
        ]
    },
    {
        "location": "Israel",
        "summary": "• Netanyahu dissolves war cabinet due to key departures.\n• Key Democrats approve major arms sale to Israel, including F-15s.\n• Eight Israeli soldiers die in Rafah amid preparations for somber Eid holiday.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Mozambique",
        "summary": "• Islamist insurgency spreads in Mozambique\n• Insurgents threaten to kill civilians\n• Violence escalates across the country",
        "coordinates": [
            -19.302233,
            34.9144977
        ]
    },
    {
        "location": "Philippines",
        "summary": "• Extreme heat causes dehydration issues in crowded prisons.\n• Heatwave affects Philippine cities, making daily life challenging.\n• Scorching temperatures threaten public health due to overcrowding in prisons.",
        "coordinates": [
            12.7503486,
            122.7312101
        ]
    },
    {
        "location": "Saudi Arabia",
        "summary": "• Muslims worldwide mark Eid al-Adha with festivities.\n• Severe heat in Mecca claims lives during Hajj pilgrimage.\n• Temperature records broken at Mecca's hottest spot.",
        "coordinates": [
            25.6242618,
            42.3528328
        ]
    },
    {
        "location": "Singapore",
        "summary": "• A massive oil spill has left Singapore's popular beaches covered in blackened oil slicks.\n• The environmental disaster threatens to harm marine life and disrupt tourist activities.\n• Cleanup efforts are underway to mitigate the damage and restore affected areas.",
        "coordinates": [
            1.357107,
            103.8194992
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Zuma's MK party will join South Africa's opposition alliance.\n• The move is expected to strengthen the opposition against President Ramaphosa's ruling ANC party.\n• This development comes after years of political instability in South Africa.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Ukraine's conscription squads are forcing Ukrainian men to hide, evading military service.\n• Despite being away from war, some Ukrainian soccer players are willing to participate in combat.\n• Due to insufficient troop numbers, Ukraine is releasing prisoners to take up arms.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Rod Stewart defended his support for Ukraine amidst jeers.\n• Princess Kate attended the king's parade, her first public event since cancer news.\n• The Queen hosted a reception for Ukrainian refugees at Windsor Castle.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Maryland pardons 175,000 people with cannabis-related convictions.\n• A US pastor gets 9-year sentence for financial crimes.\n• The President waives penalties for some immigrants who entered the country illegally as spouses of American citizens.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]