[
    {
        "location": "Australia",
        "summary": "• Australia's new 'men's behavior change' secretary acknowledges that the role will be challenging.\n• The secretary recognizes that addressing men's behavior requires a deep understanding of societal norms and values.\n• The position aims to promote positive social change through targeted interventions.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Canada",
        "summary": "• A Canadian paleontologist discovers a significant dinosaur fossil in Alberta, estimated to be worth over $1 million.\n• The fossil is expected to provide valuable insights into prehistoric life during the Late Cretaceous period.\n• Further research will help scientists learn more about this ancient species and its habitat.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "Egypt",
        "summary": "• A viral social media post has garnered over 47 million shares.\n• It focuses attention on the situation in Rafah, Egypt.\n• No further details about the post or its content are provided.",
        "coordinates": [
            26.2540493,
            29.2675469
        ]
    },
    {
        "location": "France",
        "summary": "• A model sues over Cannes red carpet 'assault'.\n• Russia not invited to D-Day 80th anniversary ceremonies.\n• The Élysée Palace announces that Russia has been excluded from the celebrations marking the 80th anniversary of D-Day in France.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Hong Kong",
        "summary": "• Hong Kong convicts 14 activists of subversion.\n• Convictions involve 14 pro-democracy activists.\n• Landmark case.",
        "coordinates": [
            22.2793278,
            114.1628131
        ]
    },
    {
        "location": "Iceland",
        "summary": "• South Korea's government is offering financial incentives to encourage men who have had vasectomies to reverse the procedure due to a declining birth rate.\n• An Icelandic volcano has erupted, producing intense lava flows in what may be its most powerful eruption yet.",
        "coordinates": [
            64.9841821,
            -18.1059013
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel has extended its control over Gaza's entire land border.\n• Most Israelis believe the military's campaign in Gaza was \"about right\" or insufficient.\n• The US-made F16I Sufa fighter jets were reportedly involved in a deadly strike in Rafah.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• Italian Prime Minister states that fascism is \"consigned to history\".\n• Many disagree with this assessment.\n• There remains uncertainty about the current state of fascism in Italy.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "New Zealand",
        "summary": "• Thousands of people rallied in New Zealand to show their support for Māori rights.\n• The event aimed to raise awareness about ongoing issues faced by the indigenous Māori community.\n• Participants called for greater recognition and protection of Māori cultural heritage and interests.",
        "coordinates": [
            -41.5000831,
            172.8344077
        ]
    },
    {
        "location": "North Korea",
        "summary": "• North Korea launched waste-filled balloons towards South Korea as a form of provocation.\n• The move is seen as a deliberate attempt to stir up tensions between the two nations.\n• The balloons carried propaganda materials and other items aimed at ridiculing the South Korean government.",
        "coordinates": [
            40.3736611,
            127.0870417
        ]
    },
    {
        "location": "Slovakia",
        "summary": "• The Prime Minister of Slovakia has been hospitalized due to health issues\n• He was shot during an incident outside his office in Bratislava\n• He is being treated at a hospital in the capital city",
        "coordinates": [
            48.7411522,
            19.4528646
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Partial results indicate that the African National Congress (ANC) may lose its majority.\n• This suggests a significant electoral setback for the ruling party.\n• The outcome could have far-reaching implications for South African politics.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Spain",
        "summary": "• Spain's government has approved an amnesty law that grants pardons to those involved in Catalonia's independence movement\n• The law aims to ease tensions between Madrid and Barcelona by forgiving individuals who have been detained or prosecuted for their roles in the push for secession\n• The move is seen as a step towards reconciliation and healing after years of political turmoil in Catalonia",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Ukraine allowed to strike certain Russian targets using US-supplied weapons.\n• The country is facing its most severe crisis since the beginning of the conflict.\n• US President Biden has authorized Ukraine to conduct limited strikes within Russia.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• A tycoon was ordered to pay $1 billion in a record-breaking divorce settlement.\n• The UK Parliament has dissolved ahead of a general election.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Donald Trump found guilty on all counts in historic criminal trial\n• Trump says verdict is \"a disgrace\" and claims it will impact his ability to run for President again; sentencing set for July 11th\n• The earliest and most distant galaxy ever observed has been identified by astronomers",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]