[
    {
        "location": "Bangladesh",
        "summary": "• Deadly unrest spreads across Bangladesh due to disputes over job quotas.\n• Protests turn violent, leading to fatalities in multiple regions.\n• The government struggles to maintain order amidst growing tensions.",
        "coordinates": [
            -0.2864982,
            36.0514231
        ]
    },
    {
        "location": "Canada",
        "summary": "• Severe storms cause flooding and power outages in Toronto.\n• Drake's Toronto home \"The Embassy\" is affected by the floods.\n• The city faces significant damage due to the storm.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• In China, housing used to be a symbol of success but it has become a financial burden instead.\n• Many Chinese people have seen their savings dwindle as they struggle to afford housing costs.\n• As a result, the traditional notion of housing as a path to prosperity is being rewritten.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "France",
        "summary": "• Princess Catherine returns to the public eye after announcing her cancer diagnosis.\n• The Olympic flame arrives in Paris, marking the start of the Bastille Day celebrations.\n• The Olympic torch will feature prominently during the Bastille Day parade.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Gambia",
        "summary": "• The Gambian government has maintained its ban on female genital cutting despite pressure to repeal it.\n• The ban aims to protect women and girls from the harmful practice.\n• Despite the ban, some girls continue to undergo the procedure, often secretly.",
        "coordinates": [
            13.470062,
            -15.4900464
        ]
    },
    {
        "location": "India",
        "summary": "• Indians express support for Donald Trump amidst violent protests.\n• Frustration and flooding reported in areas near an upscale Indian wedding event.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Leo Varadkar announces his decision to step down as leader before the next Irish election.\n• The exact timing of his departure has not been disclosed.\n• His resignation is expected to have significant implications for the country's political landscape.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• 50 people have been reported as killed in the latest Israeli strikes on Gaza.\n• Since October 7, 2021, Israel has claimed that they have killed over half of Hamas' military leadership.\n• The Israeli military seems to be wary about going to war with Lebanon.\n• In Gaza, it was stated that 90 people were killed during an attack from Israel that targeted a high-ranking Hamas military leader named Mohamed Deif.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Kenya",
        "summary": "• A series of unsolved murders has taken place in Kenya, sparking widespread concern about the lack of justice.\n• The case has garnered significant attention due to its similarity to previous cases involving unidentified killers.\n• Investigators are working tirelessly to uncover clues and apprehend the perpetrator(s), with several suspects already under scrutiny.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Oman",
        "summary": "• The Islamic State group has claimed responsibility for a deadly attack in Oman.\n• No further details have been provided regarding the specifics of the attack or its impact on the local population.\n• Omani authorities are likely to investigate and respond to this incident accordingly.",
        "coordinates": [
            21.0000287,
            57.0036901
        ]
    },
    {
        "location": "Spain",
        "summary": "• The Spain national football team chanted \"Gibraltar is Spanish\" during their Euro 2020 victory celebrations.\n• This chant highlights the ongoing dispute between Spain and Gibraltar over sovereignty of the territory.\n• The statement reinforces Spain's claim to Gibraltar despite its recent annexation by Britain in 1707.",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Sweden",
        "summary": "• Two British citizens go missing in Sweden.\n• Bodies discovered inside a car.\n• The identities of the victims remain unknown.",
        "coordinates": [
            59.6749712,
            14.5208584
        ]
    },
    {
        "location": "Thailand",
        "summary": "• 6 people were found dead in a hotel room in Bangkok.\n• Two of those who died were from America.\n• Officials are trying to find out why they died.",
        "coordinates": [
            7.4931858,
            124.724704
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Princess Kate will present the trophy to the men's Wimbledon winner.\n• This is according to an official statement from the palace.\n• The event takes place during the Wimbledon tennis tournament.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Trump had his security increased after an Iranian plot was discovered to kill him.\n• Defeated Trump opponents spoke out for unity during the Republican Convention.\n• Senator Bob Menendez has been found guilty of bribery.\n• Joe Biden is considering major changes to the US Supreme Court.\n• Trump recently appeared at a convention after being shot.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]