[
    {
        "location": "Canada",
        "summary": "• A potential \"housing revolution\" could transform Canadian cities.\n• Two articles discuss this possibility.\n• Serial killer Robert Pickton died in prison.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• A Chinese spacecraft has successfully landed on the far side of the moon.\n• The mission aims to collect rare lunar samples from the unexplored region known as the \"dark\" side of the moon.\n• This achievement marks a significant milestone in China's ambitious space exploration program.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "France",
        "summary": "• Kylian Mbappé signs with Real Madrid\n• A significant transfer between European football clubs",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Germany",
        "summary": "• A police officer was stabbed in Mannheim.\n• The officer later died from their injuries.\n• This incident occurred on an unspecified date.",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Iceland",
        "summary": "• An Icelandic volcano has erupted, producing mesmerizing lava rivers.\n• The eruption is causing widespread damage to the surrounding area.\n• The exact location of the eruption has not been disclosed by authorities.",
        "coordinates": [
            64.9841821,
            -18.1059013
        ]
    },
    {
        "location": "India",
        "summary": "• India's general elections saw arrests and allegations surrounding the process.\n• The country held the largest democratic event in the world.\n• Reports emerged of electoral irregularities despite the conclusion of voting.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Israel",
        "summary": "• The US expects Israel to accept a Gaza ceasefire plan if Hamas agrees.\n• Biden's ceasefire plan increases pressure on Netanyahu within Israel.\n• Israeli reservists question their role after fighting in Gaza.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Italy",
        "summary": "• Gay conversion therapy is being practiced in Italy.\n• Many people have undergone this therapy, which aims to change their sexual orientation.\n• Participants describe it as the \"darkest period\" of their lives.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Mexico",
        "summary": "• Mexico holds historic presidential election, with a strong possibility of electing its first female president.\n• The election marks a significant milestone in Mexican politics.\n• Three main candidates are vying for the top spot: Andrés Manuel López Obrador, Ricardo Anaya, and José Antonio Meade.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "South Africa",
        "summary": "• South Africa's president faces a challenging period due to a disappointing electoral performance.\n• The African National Congress (ANC) must reassess its strategy after receiving a low vote count in recent elections.\n• The party needs to revamp its approach to regain voter trust and secure better outcomes in future polls.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Sri Lanka",
        "summary": "• At least seven people have been killed in Sri Lanka due to monsoon floods.\n• Heavy rainfall has caused widespread flooding across the country.\n• The exact number of fatalities may increase as rescue efforts continue.",
        "coordinates": [
            7.5554942,
            80.7137847
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Zelensky accuses Russia and China of undermining the summit.\n• Ukrainian military commanders criticize basic training as inadequate.\n• Russian and Chinese interference hampers peace efforts in Ukraine.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• Media tycoon Rupert Murdoch has married for the fifth time.\n• This is his fourth marriage since he lost his previous wife in 2016.\n• His new wife, Ann Lesley Sharp, is an English actress.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Donald Trump says hush-money trial is \"very hard\" on his wife Melania.\n• One person was killed and many others were injured in an Ohio mass shooting.\n• The United States has proposed a ceasefire plan for the conflict in Gaza.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]