[
    {
        "location": "Argentina",
        "summary": "• The IMF has reported that Argentina's economic growth rate has accelerated to 2.5% in Q1 2021, exceeding expectations.\n• Inflation remains under control at 12.7%, down from 30% last year, thanks to strict fiscal discipline.\n• Despite a strong dollar appreciation, exports have grown by 13.4%, contributing to the country's economic recovery.",
        "coordinates": [
            -34.9964963,
            -64.9672817
        ]
    },
    {
        "location": "China",
        "summary": "• Four US college educators were stabbed by an unknown assailant in a Chinese park.\n• The incident occurred without any clear motive or warning signs.\n• Authorities are investigating the attack, which has sparked concerns about safety in China.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Denmark",
        "summary": "• The Danish Prime Minister is still recovering from a recent street attack.\n• They have been unable to return to work due to ongoing health issues.\n• The incident has sparked concerns about their safety in public spaces.",
        "coordinates": [
            55.670249,
            10.3333283
        ]
    },
    {
        "location": "France",
        "summary": "• The French right is up in arms over demands for a far-right alliance.\n• The IOC has been urged to intervene to lift France's hijab ban.\n• Macron sees snap elections as a sign of trust, while Europe swings rightward in EP polls.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Haiti",
        "summary": "• Haiti has formed a new government amid ongoing gang violence.\n• The formation of a new government is seen as a crucial step in addressing the country's security challenges.\n• Despite this development, gang violence remains a significant concern in Haiti.",
        "coordinates": [
            19.1399952,
            -72.3570972
        ]
    },
    {
        "location": "Iceland",
        "summary": "• Iceland has granted a whale hunting permit, sparking controversy over animal welfare concerns.\n• Critics argue that the permit is a step backwards in protecting marine life.\n• The decision could set a negative precedent for future permits and impact Iceland's international reputation.",
        "coordinates": [
            64.9841821,
            -18.1059013
        ]
    },
    {
        "location": "India",
        "summary": "• Two Indian nationals have been killed while working in Ukraine.\n• Indian Americans in the DMV area were shocked to see Prime Minister Narendra Modi's electoral performance was less successful than expected.\n• The deaths of the two Indian workers in Ukraine occurred under unclear circumstances.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Ireland",
        "summary": "• A crypt in Dublin was set on fire.\n• The incident occurred at a church.\n• Authorities are investigating the cause of the blaze.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "1. Rescued Israeli hostages reunite with their families.\n2. US pushes for Gaza ceasefire deal while Netanyahu faces conflicting demands.\n3. Blinken warns that Hamas' cooperation is crucial for a successful ceasefire.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Malawi",
        "summary": "• Malawi's Vice President dies in a plane crash with nine other people.\n• He had been removed from his business background to take up the role.\n• His death leaves a significant leadership vacuum in the country.",
        "coordinates": [
            -13.2687204,
            33.9301963
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Many people in South Africa have lost faith in their liberation movement due to corruption and inequality.\n• The government's failure to address these issues has led to widespread disillusionment among citizens.\n• As a result, many South Africans feel let down by their leaders and are seeking alternative solutions.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Spain",
        "summary": "• A furious bull at a Spanish rodeo escaped from its enclosure\n• The out-of-control bull hurled a spectator into the air\n• No one was seriously injured in the incident",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Sudan",
        "summary": "• The US warns that a key Sudanese city is at risk of falling to rebels.\n• This development has significant implications for regional stability.\n• The potential loss of the city would have far-reaching consequences for the region.",
        "coordinates": [
            10.9,
            6.5
        ]
    },
    {
        "location": "Thailand",
        "summary": "• A fire broke out at a famous Thai market, killing hundreds of caged animals.\n• The cause of the blaze is under investigation by local authorities.\n• Many pet owners are now left to mourn the loss of their beloved pets.",
        "coordinates": [
            7.4931858,
            124.724704
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Most Ukrainians still support fighting against Russia despite seeing the conflict as a stalemate.\n• A low-intensity conflict has been ongoing on the Israel-Lebanon border.\n• The situation in both regions remains volatile with no clear resolution in sight.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United States",
        "summary": "• Hunter Biden found guilty on all counts in gun trial.\n• US lifts weapon ban on Ukraine's Azov Brigade.\n• President Biden's son faces potential consequences after guilty verdict.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]