[
    {
        "location": "Australia",
        "summary": "• Shark attacks are increasing in Australia.\n• Technology plays a significant role in stopping shark attacks.\n• The use of technology helps reduce the risk of shark encounters.",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "Canada",
        "summary": "• Researchers in Canada find ship where Shackleton died\n• Celine Dion says 'I'm back' after health struggles",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• Chinese women are using AI chatbots like ChatGPT for dating due to their convenience and efficiency.\n• These platforms offer an alternative to traditional dating methods, providing users with a sense of control over potential matches.\n• The use of AI in relationships raises questions about the nature of human connection and intimacy in the digital age.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Cuba",
        "summary": "• Russia's military presence in Cuba has grown significantly with the arrival of multiple warships.\n• The ships will be docked at Havana's port and are expected to stay for an extended period.\n• This move is seen as a strategic shift by both nations amid growing global tensions.",
        "coordinates": [
            23.0131338,
            -80.8328748
        ]
    },
    {
        "location": "Germany",
        "summary": "• Germany is considering reinstating mandatory national service amidst growing concerns about European security\n• The move aims to strengthen military capabilities and contribute to NATO's defense efforts\n• National service would require citizens to serve in the armed forces or participate in civilian defense programs",
        "coordinates": [
            51.1638175,
            10.4478313
        ]
    },
    {
        "location": "Greece",
        "summary": "• A US tourist has gone missing on a Greek island\n• The individual was last seen several days ago \n• Authorities have launched an investigation to locate them safely",
        "coordinates": [
            39.0742,
            21.8243
        ]
    },
    {
        "location": "Hungary",
        "summary": "• EU court imposes €200 million fine on Hungary\n• Fine is related to Hungary's asylum policy \n• Asylum seekers will likely face more challenges in Hungary due to this decision",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "Iraq",
        "summary": "• A massive fire broke out at an oil refinery in Iraq.\n• The blaze is currently being contained by firefighters and emergency responders.\n• There are no reports of casualties or injuries so far.",
        "coordinates": [
            33.0955793,
            44.1749775
        ]
    },
    {
        "location": "Italy",
        "summary": "• Italy's Meloni is being hosted at the G-7 meeting by Western leaders.\n• She was elected as Prime Minister after having a successful campaign based on her right-wing policies.\n• There were fights going on in the Italian Parliament before the meeting started.",
        "coordinates": [
            42.6384261,
            12.674297
        ]
    },
    {
        "location": "Kenya",
        "summary": "• A police officer shot a magistrate in an open court in Kenya.\n• The incident occurred at a local courthouse in Nairobi, capital city of Kenya.\n• The motive behind the shooting is still unknown as investigations continue to determine if it was an isolated act or part of a larger conspiracy.",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Hezbollah launches rocket attacks on Israel\n• US blames Hamas for prolonging Gaza conflict\n• Rocket attacks by Hezbollah target Israeli positions",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "Mexico",
        "summary": "• New research on ancient Mayan child sacrifices\n• DNA analysis reveals surprising details about chosen victims\n• Insights into Mayan culture and traditions",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "South Africa",
        "summary": "• South Africa's ANC is close to forming a unity government.\n• The party aims to strengthen its position in the country.\n• Mpox has caused two deaths in South Africa.",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "South Korea",
        "summary": "• A gym in South Korea has sparked controversy with its sign stating that only \"elegant\" women are allowed to enter.\n• The sign's wording has been criticized as discriminatory towards those who do not meet traditional beauty standards.\n• Many have called for the gym to remove or modify the sign to ensure equal access to fitness facilities regardless of appearance.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Sudan",
        "summary": "• Evidence suggests that Iran and UAE have supplied drones to Sudan\n• This could escalate tensions between Sudanese factions and foreign actors\n• Drones may be used for surveillance, intelligence gathering, or even combat",
        "coordinates": [
            10.9,
            6.5
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• The US will provide a second Patriot air defense battery to Ukraine.\n• A 10-year US-Ukraine security deal will be signed by Biden and Zelensky during the G-7 summit.\n• Ukraine pushes the US to supply combat gear despite concerns about its effectiveness.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• UK's Labour leader Keir Starmer has toned down his socialist stance.\n• He aims to create a \"changed\" party.\n• This shift marks a departure from traditional Labour values.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "•\tTrump visits Capitol Hill for first time since January 6 riot\n•\tSupreme Court rejects challenge to restrict abortion drug access\n•\tBiden refuses to reduce son's sentence",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Yemen",
        "summary": "• A Houthi missile attack severely injured a sailor.\n• The US is aware of this incident.\n• The attacker was from the Houthi group.",
        "coordinates": [
            16.3471243,
            47.8915271
        ]
    }
]