[
    {
        "location": "Afghanistan",
        "summary": "• The Taliban has restricted opportunities for Afghan women in society.\n• Many Afghan women are leading secret lives online to circumvent these restrictions.\n• These women use social media platforms to connect with others and access information despite the lack of personal freedom.",
        "coordinates": [
            33.7680065,
            66.2385139
        ]
    },
    {
        "location": "China",
        "summary": "• A tornado hit a Chinese city, causing debris to fly through the air.\n• The tornado caused significant damage and disruption in the affected area.\n• Emergency responders were quickly deployed to assist those affected by the disaster.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "France",
        "summary": "• France has drawn a line under its troubled election campaign.\n• The country prepares for a pivotal moment in its history with an upcoming vote.\n• Fifty violent incidents have shaken France just days from the ballot box.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Hungary",
        "summary": "• Hungary's Prime Minister meets with Putin in Moscow\n• Viktor Orban visits Moscow, upsetting EU allies\n• Hungary's leader visits Moscow, causing tension",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "Iran",
        "summary": "• A hardliner and a reformist will face each other in the Iranian presidential runoff.\n• The country is holding an election to choose its next leader.\n• Low voter turnout could indicate dissatisfaction with the government or other factors affecting participation.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel's settlement construction in East Jerusalem sparks tensions with Palestinians over land ownership.\n• The Israeli-Palestinian conflict is marked by ongoing disputes over territory and resources.\n• Despite efforts to negotiate a peaceful resolution, talks between Israel and Hamas remain inconclusive.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Jamaica",
        "summary": "• Hurricane Beryl has left Jamaica after causing damage.\n• The storm is now heading towards the Cayman Islands.\n• Jamaica was severely affected by the hurricane's passage.",
        "coordinates": [
            18.1850507,
            -77.3947693
        ]
    },
    {
        "location": "Japan",
        "summary": "• Japan has effectively ended its reliance on floppy disks.\n• Despite this progress, many Japanese companies still use outdated technology.\n• The country's fondness for legacy systems persists despite efforts to modernize.",
        "coordinates": [
            36.5748441,
            139.2394179
        ]
    },
    {
        "location": "Kenya",
        "summary": "• The Kenyan leader faced intense criticism from young people during an online debate\n• The confrontation highlighted concerns over youth unemployment and lack of opportunities\n• The exchange sparked widespread discussion about the government's role in addressing these issues",
        "coordinates": [
            1.4419683,
            38.4313975
        ]
    },
    {
        "location": "Mexico",
        "summary": "• Hurricane Beryl hits Mexico's coast\n• Tourist hotspots affected by hurricane",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Nigeria",
        "summary": "• A couple celebrates 50 years of marriage in a city known as \"Nigeria's divorce capital\"\n• The celebration highlights the rarity of long-lasting marriages in this particular region\n• Despite being in a place infamous for high rates of marital separation, they have managed to maintain their union for five decades",
        "coordinates": [
            9.6000359,
            7.9999721
        ]
    },
    {
        "location": "Romania",
        "summary": "• Romanian authorities allow Andrew Tate to leave the country\n• However, he remains banned from entering the European Union due to his controversial past\n• This decision comes after concerns over his involvement in human trafficking and online harassment cases",
        "coordinates": [
            45.9852129,
            24.6859225
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• Power outages force medical professionals in Ukraine to perform surgeries by candlelight.\n• The Russian invasion has severely damaged Ukraine's energy infrastructure, leaving many communities without access to reliable power.\n• In response, Ukraine is rebuilding its energy sector with a focus on renewable energy sources like solar and wind power.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• The UK has elected a new PM, Keir Starmer.\n• Labour's historic win marks an end to 14 years of Conservative rule.\n• Key figures in Starmer's new government remain unknown.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• Biden faces donor pressure over his re-election campaign.\n• Wildfires have forced evacuations in California.\n• Biden has vowed to remain in the race and defeat Trump.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]