[
    {
        "location": "Australia",
        "summary": "• A devastating bushfire ravaged Australia\n• The fire was sparked by an out-of-control campfire\n• One man claimed he tried to kill others in the blaze",
        "coordinates": [
            -24.7761086,
            134.755
        ]
    },
    {
        "location": "China",
        "summary": "• China is experiencing another year of extreme heat and flooding due to climate change.\n• The country's leaders are waking up to the reality of their environmental challenges.\n• Climate change has severe consequences, including heatwaves and devastating floods.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "Ethiopia",
        "summary": "• A person recounts their harrowing experience of being kidnapped by armed men in Ethiopia\n• The individual managed to escape from their captors after a terrifying ordeal\n• Details of the incident remain unclear but highlight the dangers faced by individuals in Ethiopia",
        "coordinates": [
            10.2116702,
            38.6521203
        ]
    },
    {
        "location": "France",
        "summary": "• Carla Bruni-Sarkozy faces charges of witness tampering.\n• An Ariane-6 rocket successfully launched into space during its inaugural flight.\n• The upcoming Paris Olympics may set a new standard for accommodating competing mothers.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Greece",
        "summary": "• NBA star becomes first black Greek Olympic flagbearer\n• Historic milestone in representation and diversity\n• Breaks barriers in promoting inclusivity and equality",
        "coordinates": [
            39.0742,
            21.8243
        ]
    },
    {
        "location": "India",
        "summary": "• A lavish Indian wedding has gone viral globally.\n• It features an elaborate ceremony with traditional attire and customs.\n• The event showcases India's rich cultural heritage to international audiences.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iraq",
        "summary": "• Abu Bakr al-Baghdadi's widow was sentenced to death in Iraq\n• No further details provided",
        "coordinates": [
            33.0955793,
            44.1749775
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Pilots' union to suspend Aer Lingus industrial action\n• Industrial action suspended \n• No further information available",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• Israel demands evacuation from Gaza City.\n• Hundreds of thousands affected by the call for evacuation.\n• Gaza City's healthcare system collapses under renewed Israeli aggression.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Japan",
        "summary": "• Japan seeks to ease bear-hunting restrictions amid rising incidents\n• Authorities consider loosening regulations due to increased human-bear conflicts\n• Decision aims to reduce threat from bears while ensuring public safety",
        "coordinates": [
            36.5748441,
            139.2394179
        ]
    },
    {
        "location": "Lebanon",
        "summary": "• Fears of a potential war between Israel and Lebanon have intensified.\n• The escalation in tensions is driven by concerns over Hezbollah's military capabilities.\n• This has raised alarm bells among regional powers, who fear a conflict could destabilize the entire region.",
        "coordinates": [
            40.375713,
            -76.4626118
        ]
    },
    {
        "location": "South Korea",
        "summary": "• A South Korean politician has sparked outrage by blaming women for the rising number of male suicides.\n• The politician's comments have been widely criticized as insensitive and offensive.\n• Many people in South Korea are calling for greater awareness about mental health issues to reduce suicide rates.",
        "coordinates": [
            36.638392,
            127.6961188
        ]
    },
    {
        "location": "Spain",
        "summary": "• Protesters in Barcelona use water guns to deter tourists\n• Locals unhappy with influx of visitors\n• Tourists targeted by residents",
        "coordinates": [
            39.3260685,
            -4.8379791
        ]
    },
    {
        "location": "Sudan",
        "summary": "• A photographer undertook an 11-day trek to escape war-torn Sudan.\n• The photographer faced numerous challenges during their journey.\n• The trek was a dangerous undertaking due to the ongoing conflict in Sudan.",
        "coordinates": [
            10.9,
            6.5
        ]
    },
    {
        "location": "USA",
        "summary": "• George Clooney urges Joe Biden to quit as the Democratic presidential candidate.\n• Alec Baldwin pretended to hold a real weapon during a rehearsal for the film \"Rust.\"\n• British politician Keir Starmer met US President Joe Biden to strengthen their special bond.\n• A teenager stopped a runaway boat by jumping off a jet ski.\n• The NATO summit may affect Joe Biden's chances of being elected.\n• Alec Baldwin pretended to hold a real weapon during a rehearsal for the film \"Rust.\"\n• British politician Keir Starmer met US President Joe Biden to strengthen their special bond.\n• US officials plan to supply 500-pound bombs to Israel despite previously suspending this practice.\n• The United States is providing additional air defense systems to protect against further missile strikes on civilian targets such as hospitals in Ukraine.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• NATO vows \"irreversible path\" to Ukraine membership.\n• Ukraine's first F-16 fighter jets may engage in combat missions this summer.\n• NATO promises long-term support for Ukraine, but doesn't guarantee membership.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    }
]