[
    {
        "location": "Belarus",
        "summary": "• A German national was sentenced to death in Belarus.\n• The sentence has sparked controversy due to unknown circumstances surrounding the case.\n• Questions remain about the fairness of the trial and potential human rights violations.",
        "coordinates": [
            53.4250605,
            27.6971358
        ]
    },
    {
        "location": "Canada",
        "summary": "• Celine Dion is back on stage after her health struggles.\n• A massive wildfire has destroyed parts of the beautiful Canadian city of Jasper in the Rocky Mountains.\n• Canadians are becoming increasingly disappointed with their Prime Minister, Justin Trudeau.\n• Over 170 wildfires are currently burning across the province of Alberta.",
        "coordinates": [
            61.0666922,
            -107.991707
        ]
    },
    {
        "location": "China",
        "summary": "• A Chinese company has been aiding Russia in its war with Ukraine through its machine tools.\n• The tools have played a crucial role in Russia's military campaign, enabling them to target Ukrainian forces effectively.\n• This partnership between China and Russia highlights the growing ties between the two nations despite international sanctions imposed on Russia.",
        "coordinates": [
            35.000074,
            104.999927
        ]
    },
    {
        "location": "France",
        "summary": "• The Paris 2024 opening ceremony was lit up in a unique way\n• Chaos occurred in Paris due to rail sabotage during the opening of the Olympics\n• Arson attacks targeted France’s high-speed trains just hours before the Olympics began",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Ireland",
        "summary": "• The Dublin Wax Museum has removed its Sinead O'Connor figure\n• The exact reason for removal is unclear\n• Fans have expressed disappointment at the decision",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "• Thousands protested during Netanyahu's address to the US Congress.\n• Israel recovered the bodies of five hostages amidst delays in ongoing negotiations regarding an agreement.\n• No additional information is provided beyond these three key points.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Japan",
        "summary": "• Japan's last atomic bomb survivors urge \"atomic bomb hell\" must never be repeated.\n• They warn against repeating such atrocities in the future.\n• The survivors stress that humanity must learn from its mistakes to prevent similar disasters.",
        "coordinates": [
            36.5748441,
            139.2394179
        ]
    },
    {
        "location": "Mexico",
        "summary": "• Mexico was not informed about the arrest of top Sinaloa cartel leaders.\n• The arrested leaders include the sons of El Chapo.\n• These arrests will impact the operations of the Sinaloa cartel.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Nepal",
        "summary": "• Family members who went to assist in rescue efforts after a landslide tragically lost their lives.\n• The incident highlights the risks faced by those attempting to aid others during natural disasters.\n• It serves as a poignant reminder of the importance of caution when responding to emergencies.",
        "coordinates": [
            28.3780464,
            83.9999901
        ]
    },
    {
        "location": "Philippines",
        "summary": "• People were rescued in the Philippines amid flooding caused by Typhoon.\n• Shops and streets were inundated with floodwaters due to the typhoon.\n• The rescue operation aimed to evacuate people from flooded areas.",
        "coordinates": [
            12.7503486,
            122.7312101
        ]
    },
    {
        "location": "South Africa",
        "summary": "• Mass killer dies in prison\n• Victims continue to demand justice\n• Demand for accountability remains strong",
        "coordinates": [
            -28.8166236,
            24.991639
        ]
    },
    {
        "location": "Ukraine",
        "summary": "• The increasing use of drones in Ukraine's conflict highlights their potential to revolutionize modern warfare.\n• Drones offer tactical advantages such as surveillance, reconnaissance, and precision strikes, which could influence how wars are fought in the future.\n• As drone technology advances, it may also lead to new challenges and opportunities for military strategy and international law.",
        "coordinates": [
            49.4871968,
            31.2718321
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• UK ends opposition to ICC arrest warrants for Israeli leaders\n• Police violence sparks protests after kicking passenger in airport video\n• New British state company to build offshore wind farms on King's seabed\n• Archaeologists find century-old wreck carrying 100 champagne bottles",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• J.D. Vance defends his \"childless cat ladies\" comment amid backlash.\n• El Chapo's brother, El Mayo, arrested in the US after 35 years on the run.\n• President Trump attempts to end Kamala Harris' honeymoon with three strategies.\n• US court rules that some \"boneless\" chicken wings may contain bones.\n• A car drives through a wildfire in California.\n• Joe Biden delivers key speeches after withdrawing from presidential race.\n• Details emerge about Trump's security team failure to protect him from a shooter.\n• Justin Timberlake is said not to be drunk at the time of his arrest.\n• Kamala Harris requests an immediate ceasefire and hostage release after her meeting with Israel Prime Minister Benjamin Netanyahu.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    },
    {
        "location": "Venezuela",
        "summary": "• Venezuela holds elections on Sunday.\n• Could real change be coming?\n• Is this the beginning of the end for the Maduro regime in Venezuela?",
        "coordinates": [
            8.0018709,
            -66.1109318
        ]
    }
]