[
    {
        "location": "Afghanistan",
        "summary": "• Talks between Afghan government representatives and the Taliban have begun.\n• The talks will exclude female participants due to Taliban restrictions.\n• The negotiations aim to find a peaceful solution to the conflict in Afghanistan.",
        "coordinates": [
            33.7680065,
            66.2385139
        ]
    },
    {
        "location": "Brazil",
        "summary": "• Over 30 passengers injured in severe turbulence on Air Europa flight.\n• Flight diverted to Brazil due to safety concerns.\n• Passengers receive medical attention upon arrival at Brazilian airport.",
        "coordinates": [
            -10.3333333,
            -53.2
        ]
    },
    {
        "location": "France",
        "summary": "• Far-right candidates have withdrawn from the race to prevent them from winning.\n• The far-right party has taken the lead after the first round of voting.\n• Many people on the left believe they now have a chance to win due to the decline of centrist candidate Emmanuel Macron.",
        "coordinates": [
            46.603354,
            1.8883335
        ]
    },
    {
        "location": "Hungary",
        "summary": "• Viktor Orban urges a ceasefire during his visit to Kyiv.\n• Viktor Orban visits Ukraine and proposes a ceasefire.\n• Hungary opposes European Union policies and supports far-right ideology.",
        "coordinates": [
            47.1817585,
            19.5060937
        ]
    },
    {
        "location": "India",
        "summary": "• Over 100 people were killed in a stampede during an Indian religious event.\n• The incident occurred due to overcrowding and lack of crowd control measures.\n• Authorities have launched an investigation into the cause of the tragedy.",
        "coordinates": [
            22.3511148,
            78.6677428
        ]
    },
    {
        "location": "Iran",
        "summary": "• Iran is set to hold its presidential election.\n• The country's Supreme Leader will appoint the next president from the top four candidates who receive the most votes.\n• This election marks a significant milestone in Iranian politics as it determines the direction of the country's future governance.",
        "coordinates": [
            32.6475314,
            54.5643516
        ]
    },
    {
        "location": "Ireland",
        "summary": "• Three people were killed in road accidents in Ireland.\n• Famous Irish celebrities visited the town of Muff.\n• A woman and her child were among those who died.",
        "coordinates": [
            52.865196,
            -7.9794599
        ]
    },
    {
        "location": "Israel",
        "summary": "1. Israel's conscription rule sparks outrage among ultra-Orthodox Jews.\n2. A former Netanyahu supporter turns against him after her son is taken hostage by Hamas.",
        "coordinates": [
            30.8124247,
            34.8594762
        ]
    },
    {
        "location": "Mexico",
        "summary": "• A violent gang fight in Mexico resulted in multiple deaths.\n• The incident occurred between rival gangs, leaving behind a large number of casualties.\n• Authorities are investigating the motive behind the brutal conflict.",
        "coordinates": [
            19.4326296,
            -99.1331785
        ]
    },
    {
        "location": "Netherlands",
        "summary": "• The Dutch government has been sworn in\n• This follows an election win by Wilders \n• The new government is led by Wilders",
        "coordinates": [
            52.2434979,
            5.6343227
        ]
    },
    {
        "location": "New Zealand",
        "summary": "• New Zealand's shift towards conservatism is affecting its political landscape.\n• The country was previously seen as a safe haven for those fleeing the US under Donald Trump's presidency.\n• However, recent developments suggest that this perception is no longer accurate.",
        "coordinates": [
            -41.5000831,
            172.8344077
        ]
    },
    {
        "location": "Panama",
        "summary": "• US funds deportation efforts in Panama amid migrant crackdown.\n• Deportation funding is part of an ongoing campaign to reduce migration numbers.\n• The expanded migrant crackdown targets people crossing borders without proper documentation.",
        "coordinates": [
            8.559559,
            -81.1308434
        ]
    },
    {
        "location": "Sierra Leone",
        "summary": "• Sierra Leone has banned child marriage.\n• This move aims to protect children from early marriage.\n• The ban is expected to improve education outcomes for girls.",
        "coordinates": [
            8.6400349,
            -11.8400269
        ]
    },
    {
        "location": "Taiwan",
        "summary": "• Taiwan is studying Ukraine's experiences to better prepare itself for potential military conflicts.\n• This includes analyzing Ukraine's defense strategies and tactics.\n• The lessons learned may help Taiwan improve its own national security capabilities.",
        "coordinates": [
            23.5983227,
            120.83537694479215
        ]
    },
    {
        "location": "United Kingdom",
        "summary": "• The UK general election campaign is highlighting concerns over dental healthcare.\n• DIY dentistry could become a bigger issue due to its potential impact on public health.\n• Voters may prioritize oral care in their decision-making process during the election.",
        "coordinates": [
            54.7023545,
            -3.2765753
        ]
    },
    {
        "location": "United States",
        "summary": "• The sentencing of former President Trump in his hush-money case has been delayed until September.\n• Former Mayor Rudy Giuliani has been disbarred due to making false statements about the 2020 election.\n• A stingray that was found pregnant but did not have a mate has died.\n• The US paid $176 million to Moderna to help develop a vaccine against the bird flu virus.\n• Former Vice President Joe Biden believes he performed poorly during a recent debate because he had jet lag and was traveling at the time.\n• The Supreme Court ruled that former President Trump does not have complete immunity while serving as president.\n• Some doctors initially dismissed certain women's symptoms as hysteria, but now the women are speaking out against them.",
        "coordinates": [
            39.7837304,
            -100.445882
        ]
    }
]